; ModuleID = 'wc.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.Tokens = type { i64, i8**, i64*, %struct.obstack, %struct.obstack, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, %union.anon, i64, %union.anon.0, %union.anon.1, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [0 x i8] }
%union.anon = type { i64 }
%union.anon.0 = type { i8* (i64)* }
%union.anon.1 = type { void (i8*)* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.argv_iterator = type { %struct._IO_FILE*, i64, i8*, i64, i8**, i8** }
%struct.fstatus = type { i32, %struct.stat }
%struct.__mbstate_t = type { i32, %union.anon.2 }
%union.anon.2 = type { i32 }
%struct.mbchar = type { i8*, i64, i8, i32, [24 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "page_size", scope: !2, file: !3, line: 75, type: !115, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !51, globals: !341, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "src/wc.c", directory: "/home/philipp/GIT-Repos/coreutils")
!4 = !{!5, !20, !27, !36}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !6, line: 32, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/philipp/GIT-Repos/coreutils")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "argv_iter_err", file: !21, line: 25, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "./lib/argv-iter.h", directory: "/home/philipp/GIT-Repos/coreutils")
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "AI_ERR_OK", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "AI_ERR_EOF", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "AI_ERR_MEM", value: 3, isUnsigned: true)
!26 = !DIEnumerator(name: "AI_ERR_READ", value: 4, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 45, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "./lib/fadvise.h", directory: "/home/philipp/GIT-Repos/coreutils")
!29 = !{!30, !31, !32, !33, !34, !35}
!30 = !DIEnumerator(name: "FADVISE_NORMAL", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "FADVISE_SEQUENTIAL", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "FADVISE_NOREUSE", value: 5, isUnsigned: true)
!33 = !DIEnumerator(name: "FADVISE_DONTNEED", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "FADVISE_WILLNEED", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "FADVISE_RANDOM", value: 1, isUnsigned: true)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 46, baseType: !7, size: 32, elements: !38)
!37 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!39 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!40 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!41 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!42 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!43 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!44 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!45 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!46 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!47 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!50 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!51 = !{!52, !62, !123, !127, !131, !134, !137, !144, !148, !151, !110, !152, !56, !167, !171, !174, !115, !178, !180, !58, !183, !186, !191, !255, !259, !261, !266, !269, !271, !275, !278, !283, !284, !287, !289, !292, !295, !299, !302, !305, !309, !326, !331, !335, !336, !60, !97, !182, !337}
!52 = !DISubprogram(name: "dcgettext", scope: !53, file: !53, line: 51, type: !54, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!53 = !DIFile(filename: "/usr/include/libintl.h", directory: "")
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !58, !58, !60}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !{}
!62 = !DISubprogram(name: "fputs_unlocked", scope: !63, file: !63, line: 726, type: !64, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!63 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!64 = !DISubroutineType(types: !65)
!65 = !{!60, !58, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 241, size: 1728, elements: !69)
!68 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !89, !90, !91, !92, !96, !98, !100, !104, !107, !109, !111, !112, !113, !114, !118, !119}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !67, file: !68, line: 242, baseType: !60, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !67, file: !68, line: 247, baseType: !56, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !67, file: !68, line: 248, baseType: !56, size: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !67, file: !68, line: 249, baseType: !56, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !67, file: !68, line: 250, baseType: !56, size: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !67, file: !68, line: 251, baseType: !56, size: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !67, file: !68, line: 252, baseType: !56, size: 64, offset: 384)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !67, file: !68, line: 253, baseType: !56, size: 64, offset: 448)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !67, file: !68, line: 254, baseType: !56, size: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !67, file: !68, line: 256, baseType: !56, size: 64, offset: 576)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !67, file: !68, line: 257, baseType: !56, size: 64, offset: 640)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !67, file: !68, line: 258, baseType: !56, size: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !67, file: !68, line: 260, baseType: !83, size: 64, offset: 768)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !68, line: 156, size: 192, elements: !85)
!85 = !{!86, !87, !88}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !84, file: !68, line: 157, baseType: !83, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !84, file: !68, line: 158, baseType: !66, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !84, file: !68, line: 162, baseType: !60, size: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !67, file: !68, line: 262, baseType: !66, size: 64, offset: 832)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !67, file: !68, line: 264, baseType: !60, size: 32, offset: 896)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !67, file: !68, line: 268, baseType: !60, size: 32, offset: 928)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !67, file: !68, line: 270, baseType: !93, size: 64, offset: 960)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !94, line: 131, baseType: !95)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!95 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !67, file: !68, line: 274, baseType: !97, size: 16, offset: 1024)
!97 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !67, file: !68, line: 275, baseType: !99, size: 8, offset: 1040)
!99 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !67, file: !68, line: 276, baseType: !101, size: 8, offset: 1048)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 1)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !67, file: !68, line: 280, baseType: !105, size: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !68, line: 150, baseType: null)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !67, file: !68, line: 289, baseType: !108, size: 64, offset: 1152)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !94, line: 132, baseType: !95)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !67, file: !68, line: 297, baseType: !110, size: 64, offset: 1216)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !67, file: !68, line: 298, baseType: !110, size: 64, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !67, file: !68, line: 299, baseType: !110, size: 64, offset: 1344)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !67, file: !68, line: 300, baseType: !110, size: 64, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !67, file: !68, line: 302, baseType: !115, size: 64, offset: 1472)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "/usr/local/lib/clang/10.0.0/include/stddef.h", directory: "")
!117 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !67, file: !68, line: 303, baseType: !60, size: 32, offset: 1536)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !67, file: !68, line: 305, baseType: !120, size: 160, offset: 1568)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 160, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 20)
!123 = !DISubprogram(name: "set_program_name", scope: !124, file: !124, line: 37, type: !125, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!124 = !DIFile(filename: "./lib/progname.h", directory: "/home/philipp/GIT-Repos/coreutils")
!125 = !DISubroutineType(types: !126)
!126 = !{null, !58}
!127 = !DISubprogram(name: "setlocale", scope: !128, file: !128, line: 124, type: !129, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!128 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!129 = !DISubroutineType(types: !130)
!130 = !{!56, !60, !58}
!131 = !DISubprogram(name: "bindtextdomain", scope: !53, file: !53, line: 86, type: !132, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!132 = !DISubroutineType(types: !133)
!133 = !{!56, !58, !58}
!134 = !DISubprogram(name: "textdomain", scope: !53, file: !53, line: 82, type: !135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!135 = !DISubroutineType(types: !136)
!136 = !{!56, !58}
!137 = !DISubprogram(name: "atexit", scope: !138, file: !138, line: 519, type: !139, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!138 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!139 = !DISubroutineType(types: !140)
!140 = !{!60, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{null}
!144 = !DISubprogram(name: "getpagesize", scope: !145, file: !145, line: 981, type: !146, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!145 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!146 = !DISubroutineType(types: !147)
!147 = !{!60}
!148 = !DISubprogram(name: "setvbuf", scope: !63, file: !63, line: 336, type: !149, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!149 = !DISubroutineType(types: !150)
!150 = !{!60, !66, !56, !60, !117}
!151 = !DISubprogram(name: "getenv", scope: !138, file: !138, line: 564, type: !135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!152 = !DISubprogram(name: "getopt_long", scope: !153, file: !153, line: 173, type: !154, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!153 = !DIFile(filename: "/usr/include/getopt.h", directory: "")
!154 = !DISubroutineType(types: !155)
!155 = !{!60, !60, !156, !58, !158, !165}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !153, line: 104, size: 256, elements: !161)
!161 = !{!162, !163, !164, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !160, file: !153, line: 106, baseType: !58, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !160, file: !153, line: 109, baseType: !60, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !160, file: !153, line: 110, baseType: !165, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !160, file: !153, line: 111, baseType: !60, size: 32, offset: 192)
!167 = !DISubprogram(name: "version_etc", scope: !168, file: !168, line: 60, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!168 = !DIFile(filename: "./lib/version-etc.h", directory: "/home/philipp/GIT-Repos/coreutils")
!169 = !DISubroutineType(types: !170)
!170 = !{null, !66, !58, !58, !58, null}
!171 = !DISubprogram(name: "quotearg_style", scope: !6, file: !6, line: 377, type: !172, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!172 = !DISubroutineType(types: !173)
!173 = !{!56, !5, !58}
!174 = !DISubprogram(name: "error", scope: !175, file: !175, line: 33, type: !176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!175 = !DIFile(filename: "./lib/error.h", directory: "/home/philipp/GIT-Repos/coreutils")
!176 = !DISubroutineType(types: !177)
!177 = !{null, !60, !60, !58, null}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!183 = !DISubprogram(name: "fileno", scope: !63, file: !63, line: 858, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!184 = !DISubroutineType(types: !185)
!185 = !{!60, !66}
!186 = !DISubprogram(name: "physmem_available", scope: !187, file: !187, line: 24, type: !188, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!187 = !DIFile(filename: "./lib/physmem.h", directory: "/home/philipp/GIT-Repos/coreutils")
!188 = !DISubroutineType(types: !189)
!189 = !{!190}
!190 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!191 = !DISubprogram(name: "readtokens0_init", scope: !192, file: !192, line: 38, type: !193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!192 = !DIFile(filename: "./lib/readtokens0.h", directory: "/home/philipp/GIT-Repos/coreutils")
!193 = !DISubroutineType(types: !194)
!194 = !{null, !195}
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tokens", file: !192, line: 28, size: 2304, elements: !197)
!197 = !{!198, !199, !201, !203, !253, !254}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "n_tok", scope: !196, file: !192, line: 30, baseType: !115, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !196, file: !192, line: 31, baseType: !200, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "tok_len", scope: !196, file: !192, line: 32, baseType: !202, size: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "o_data", scope: !196, file: !192, line: 33, baseType: !204, size: 704, offset: 192)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !205, line: 174, size: 704, elements: !206)
!205 = !DIFile(filename: "./lib/obstack.h", directory: "/home/philipp/GIT-Repos/coreutils")
!206 = !{!207, !208, !218, !219, !220, !221, !226, !227, !238, !249, !250, !251, !252}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !204, file: !205, line: 176, baseType: !115, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !204, file: !205, line: 177, baseType: !209, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !205, line: 167, size: 128, elements: !211)
!211 = !{!212, !213, !214}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !210, file: !205, line: 169, baseType: !56, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !210, file: !205, line: 170, baseType: !209, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !210, file: !205, line: 171, baseType: !215, offset: 128)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: -1)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !204, file: !205, line: 178, baseType: !56, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !204, file: !205, line: 179, baseType: !56, size: 64, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !204, file: !205, line: 180, baseType: !56, size: 64, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !204, file: !205, line: 185, baseType: !222, size: 64, offset: 320)
!222 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !204, file: !205, line: 181, size: 64, elements: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !222, file: !205, line: 183, baseType: !115, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !222, file: !205, line: 184, baseType: !110, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !204, file: !205, line: 186, baseType: !115, size: 64, offset: 384)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !204, file: !205, line: 193, baseType: !228, size: 64, offset: 448)
!228 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !204, file: !205, line: 189, size: 64, elements: !229)
!229 = !{!230, !234}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !228, file: !205, line: 191, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!110, !115}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !228, file: !205, line: 192, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!110, !110, !115}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !204, file: !205, line: 198, baseType: !239, size: 64, offset: 512)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !204, file: !205, line: 194, size: 64, elements: !240)
!240 = !{!241, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "plain", scope: !239, file: !205, line: 196, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !110}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !239, file: !205, line: 197, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !110, !110}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !204, file: !205, line: 200, baseType: !110, size: 64, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !204, file: !205, line: 201, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !204, file: !205, line: 202, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !204, file: !205, line: 206, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok", scope: !196, file: !192, line: 34, baseType: !204, size: 704, offset: 896)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "o_tok_len", scope: !196, file: !192, line: 35, baseType: !204, size: 704, offset: 1600)
!255 = !DISubprogram(name: "readtokens0", scope: !192, file: !192, line: 40, type: !256, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!256 = !DISubroutineType(types: !257)
!257 = !{!258, !66, !195}
!258 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!259 = !DISubprogram(name: "rpl_fclose", scope: !260, file: !260, line: 724, type: !184, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!260 = !DIFile(filename: "./lib/stdio.h", directory: "/home/philipp/GIT-Repos/coreutils")
!261 = !DISubprogram(name: "argv_iter_init_argv", scope: !21, file: !21, line: 33, type: !262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!262 = !DISubroutineType(types: !263)
!263 = !{!264, !200}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "argv_iterator", file: !21, line: 23, flags: DIFlagFwdDecl)
!266 = !DISubprogram(name: "argv_iter_init_stream", scope: !21, file: !21, line: 35, type: !267, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!267 = !DISubroutineType(types: !268)
!268 = !{!264, !66}
!269 = !DISubprogram(name: "xalloc_die", scope: !270, file: !270, line: 47, type: !142, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized, retainedNodes: !61)
!270 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/philipp/GIT-Repos/coreutils")
!271 = !DISubprogram(name: "argv_iter", scope: !21, file: !21, line: 37, type: !272, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!272 = !DISubroutineType(types: !273)
!273 = !{!56, !264, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!275 = !DISubprogram(name: "quotearg_n_style_colon", scope: !6, file: !6, line: 397, type: !276, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!276 = !DISubroutineType(types: !277)
!277 = !{!56, !60, !5, !58}
!278 = !DISubprogram(name: "argv_iter_n_args", scope: !21, file: !21, line: 39, type: !279, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!279 = !DISubroutineType(types: !280)
!280 = !{!117, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!283 = !DISubprogram(name: "readtokens0_free", scope: !192, file: !192, line: 39, type: !193, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!284 = !DISubprogram(name: "argv_iter_free", scope: !21, file: !21, line: 41, type: !285, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !264}
!287 = !DISubprogram(name: "rpl_free", scope: !288, file: !288, line: 847, type: !243, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!288 = !DIFile(filename: "./lib/stdlib.h", directory: "/home/philipp/GIT-Repos/coreutils")
!289 = !DISubprogram(name: "close", scope: !145, file: !145, line: 356, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!290 = !DISubroutineType(types: !291)
!291 = !{!60, !60}
!292 = !DISubprogram(name: "xmalloc", scope: !270, file: !270, line: 53, type: !293, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!293 = !DISubroutineType(types: !294)
!294 = !{!110, !117}
!295 = !DISubprogram(name: "open", scope: !296, file: !296, line: 156, type: !297, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!296 = !DIFile(filename: "/usr/include/fcntl.h", directory: "")
!297 = !DISubroutineType(types: !298)
!298 = !{!60, !58, !60, null}
!299 = !DISubprogram(name: "fdadvise", scope: !28, file: !28, line: 71, type: !300, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !60, !95, !95, !27}
!302 = !DISubprogram(name: "lseek", scope: !145, file: !145, line: 337, type: !303, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!303 = !DISubroutineType(types: !304)
!304 = !{!95, !60, !95, !60}
!305 = !DISubprogram(name: "safe_read", scope: !306, file: !306, line: 42, type: !307, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!306 = !DIFile(filename: "./lib/safe-read.h", directory: "/home/philipp/GIT-Repos/coreutils")
!307 = !DISubroutineType(types: !308)
!308 = !{!117, !60, !110, !117}
!309 = !DISubprogram(name: "rpl_mbrtowc", scope: !310, file: !310, line: 747, type: !311, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!310 = !DIFile(filename: "./lib/wchar.h", directory: "/home/philipp/GIT-Repos/coreutils")
!311 = !DISubroutineType(types: !312)
!312 = !{!117, !165, !58, !117, !313}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !315, line: 82, size: 64, elements: !316)
!315 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !314, file: !315, line: 84, baseType: !60, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !314, file: !315, line: 93, baseType: !319, size: 32, offset: 32)
!319 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !314, file: !315, line: 85, size: 32, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !319, file: !315, line: 88, baseType: !7, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !319, file: !315, line: 92, baseType: !323, size: 32)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 32, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 4)
!326 = !DISubprogram(name: "mbsinit", scope: !315, file: !315, line: 364, type: !327, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!327 = !DISubroutineType(types: !328)
!328 = !{!60, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!331 = !DISubprogram(name: "iswprint", scope: !332, file: !332, line: 136, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!332 = !DIFile(filename: "/usr/include/wctype.h", directory: "")
!333 = !DISubroutineType(types: !334)
!334 = !{!60, !7}
!335 = !DISubprogram(name: "wcwidth", scope: !315, file: !315, line: 442, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!336 = !DISubprogram(name: "iswspace", scope: !332, file: !332, line: 146, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!337 = !DISubprogram(name: "umaxtostr", scope: !338, file: !338, line: 29, type: !339, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!338 = !DIFile(filename: "./lib/inttostr.h", directory: "/home/philipp/GIT-Repos/coreutils")
!339 = !DISubroutineType(types: !340)
!340 = !{!56, !117, !56}
!341 = !{!342, !449, !453, !455, !457, !459, !461, !463, !465, !467, !469, !471, !473, !0, !475, !477, !482}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "stdin_only", scope: !344, file: !3, line: 799, type: !448, isLocal: true, isDefinition: true)
!344 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 680, type: !345, scopeLine: 681, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !347)
!345 = !DISubroutineType(types: !346)
!346 = !{!60, !60, !200}
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355, !397, !398, !399, !400, !405, !408, !409, !411, !412, !414, !415, !416, !418, !421, !422, !423, !426, !427, !429, !430, !432, !433, !435, !436, !438, !439, !441, !442, !447}
!348 = !DILocalVariable(name: "argc", arg: 1, scope: !344, file: !3, line: 680, type: !60)
!349 = !DILocalVariable(name: "argv", arg: 2, scope: !344, file: !3, line: 680, type: !200)
!350 = !DILocalVariable(name: "ok", scope: !344, file: !3, line: 682, type: !258)
!351 = !DILocalVariable(name: "optc", scope: !344, file: !3, line: 683, type: !60)
!352 = !DILocalVariable(name: "nfiles", scope: !344, file: !3, line: 684, type: !115)
!353 = !DILocalVariable(name: "files", scope: !344, file: !3, line: 685, type: !200)
!354 = !DILocalVariable(name: "files_from", scope: !344, file: !3, line: 686, type: !56)
!355 = !DILocalVariable(name: "fstatus", scope: !344, file: !3, line: 687, type: !356)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fstatus", file: !3, line: 81, size: 1216, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !357, file: !3, line: 85, baseType: !60, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "st", scope: !357, file: !3, line: 88, baseType: !361, size: 1152, offset: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !362, line: 46, size: 1152, elements: !363)
!362 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!363 = !{!364, !366, !368, !370, !372, !374, !376, !377, !378, !379, !381, !383, !391, !392, !393}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !361, file: !362, line: 48, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !94, line: 124, baseType: !117)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !361, file: !362, line: 53, baseType: !367, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !94, line: 127, baseType: !117)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !361, file: !362, line: 61, baseType: !369, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !94, line: 130, baseType: !117)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !361, file: !362, line: 62, baseType: !371, size: 32, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !94, line: 129, baseType: !7)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !361, file: !362, line: 64, baseType: !373, size: 32, offset: 224)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !94, line: 125, baseType: !7)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !361, file: !362, line: 65, baseType: !375, size: 32, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !94, line: 126, baseType: !7)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !361, file: !362, line: 67, baseType: !60, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !361, file: !362, line: 69, baseType: !365, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !361, file: !362, line: 74, baseType: !93, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !361, file: !362, line: 78, baseType: !380, size: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !94, line: 153, baseType: !95)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !361, file: !362, line: 80, baseType: !382, size: 64, offset: 512)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !94, line: 158, baseType: !95)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !361, file: !362, line: 91, baseType: !384, size: 128, offset: 576)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !385, line: 120, size: 128, elements: !386)
!385 = !DIFile(filename: "/usr/include/time.h", directory: "")
!386 = !{!387, !389}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !384, file: !385, line: 122, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !94, line: 139, baseType: !95)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !384, file: !385, line: 123, baseType: !390, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !94, line: 175, baseType: !95)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !361, file: !362, line: 92, baseType: !384, size: 128, offset: 704)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !361, file: !362, line: 93, baseType: !384, size: 128, offset: 832)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !361, file: !362, line: 106, baseType: !394, size: 192, offset: 960)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 192, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 3)
!397 = !DILocalVariable(name: "tok", scope: !344, file: !3, line: 688, type: !196)
!398 = !DILocalVariable(name: "read_tokens", scope: !344, file: !3, line: 748, type: !258)
!399 = !DILocalVariable(name: "ai", scope: !344, file: !3, line: 749, type: !264)
!400 = !DILocalVariable(name: "stream", scope: !401, file: !3, line: 752, type: !403)
!401 = distinct !DILexicalBlock(scope: !402, file: !3, line: 751, column: 5)
!402 = distinct !DILexicalBlock(scope: !344, file: !3, line: 750, column: 7)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !63, line: 48, baseType: !67)
!405 = !DILocalVariable(name: "__s1_len", scope: !406, file: !3, line: 764, type: !115)
!406 = distinct !DILexicalBlock(scope: !407, file: !3, line: 764, column: 11)
!407 = distinct !DILexicalBlock(scope: !401, file: !3, line: 764, column: 11)
!408 = !DILocalVariable(name: "__s2_len", scope: !406, file: !3, line: 764, type: !115)
!409 = !DILocalVariable(name: "__s2", scope: !410, file: !3, line: 764, type: !180)
!410 = distinct !DILexicalBlock(scope: !406, file: !3, line: 764, column: 11)
!411 = !DILocalVariable(name: "__result", scope: !410, file: !3, line: 764, type: !60)
!412 = !DILocalVariable(name: "__s2", scope: !413, file: !3, line: 764, type: !180)
!413 = distinct !DILexicalBlock(scope: !406, file: !3, line: 764, column: 11)
!414 = !DILocalVariable(name: "__result", scope: !413, file: !3, line: 764, type: !60)
!415 = !DILocalVariable(name: "st", scope: !401, file: !3, line: 776, type: !361)
!416 = !DILocalVariable(name: "i", scope: !417, file: !3, line: 812, type: !60)
!417 = distinct !DILexicalBlock(scope: !344, file: !3, line: 812, column: 3)
!418 = !DILocalVariable(name: "skip_file", scope: !419, file: !3, line: 814, type: !258)
!419 = distinct !DILexicalBlock(scope: !420, file: !3, line: 813, column: 5)
!420 = distinct !DILexicalBlock(scope: !417, file: !3, line: 812, column: 3)
!421 = !DILocalVariable(name: "ai_err", scope: !419, file: !3, line: 815, type: !20)
!422 = !DILocalVariable(name: "file_name", scope: !419, file: !3, line: 816, type: !56)
!423 = !DILocalVariable(name: "__s1_len", scope: !424, file: !3, line: 834, type: !115)
!424 = distinct !DILexicalBlock(scope: !425, file: !3, line: 834, column: 25)
!425 = distinct !DILexicalBlock(scope: !419, file: !3, line: 834, column: 11)
!426 = !DILocalVariable(name: "__s2_len", scope: !424, file: !3, line: 834, type: !115)
!427 = !DILocalVariable(name: "__s2", scope: !428, file: !3, line: 834, type: !180)
!428 = distinct !DILexicalBlock(scope: !424, file: !3, line: 834, column: 25)
!429 = !DILocalVariable(name: "__result", scope: !428, file: !3, line: 834, type: !60)
!430 = !DILocalVariable(name: "__s2", scope: !431, file: !3, line: 834, type: !180)
!431 = distinct !DILexicalBlock(scope: !424, file: !3, line: 834, column: 25)
!432 = !DILocalVariable(name: "__result", scope: !431, file: !3, line: 834, type: !60)
!433 = !DILocalVariable(name: "__s1_len", scope: !434, file: !3, line: 834, type: !115)
!434 = distinct !DILexicalBlock(scope: !425, file: !3, line: 834, column: 52)
!435 = !DILocalVariable(name: "__s2_len", scope: !434, file: !3, line: 834, type: !115)
!436 = !DILocalVariable(name: "__s2", scope: !437, file: !3, line: 834, type: !180)
!437 = distinct !DILexicalBlock(scope: !434, file: !3, line: 834, column: 52)
!438 = !DILocalVariable(name: "__result", scope: !437, file: !3, line: 834, type: !60)
!439 = !DILocalVariable(name: "__s2", scope: !440, file: !3, line: 834, type: !180)
!440 = distinct !DILexicalBlock(scope: !434, file: !3, line: 834, column: 52)
!441 = !DILocalVariable(name: "__result", scope: !440, file: !3, line: 834, type: !60)
!442 = !DILocalVariable(name: "file_number", scope: !443, file: !3, line: 857, type: !117)
!443 = distinct !DILexicalBlock(scope: !444, file: !3, line: 853, column: 13)
!444 = distinct !DILexicalBlock(scope: !445, file: !3, line: 850, column: 15)
!445 = distinct !DILexicalBlock(scope: !446, file: !3, line: 845, column: 9)
!446 = distinct !DILexicalBlock(scope: !419, file: !3, line: 844, column: 11)
!447 = !DILabel(scope: !344, name: "argv_iter_done", file: !3, line: 872)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 64, elements: !102)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "total_lines", scope: !2, file: !3, line: 58, type: !451, isLocal: true, isDefinition: true)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !452, line: 135, baseType: !117)
!452 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "total_words", scope: !2, file: !3, line: 59, type: !451, isLocal: true, isDefinition: true)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "total_chars", scope: !2, file: !3, line: 60, type: !451, isLocal: true, isDefinition: true)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "total_bytes", scope: !2, file: !3, line: 61, type: !451, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "max_line_length", scope: !2, file: !3, line: 62, type: !451, isLocal: true, isDefinition: true)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "print_lines", scope: !2, file: !3, line: 65, type: !258, isLocal: true, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "print_words", scope: !2, file: !3, line: 65, type: !258, isLocal: true, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "print_chars", scope: !2, file: !3, line: 65, type: !258, isLocal: true, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "print_bytes", scope: !2, file: !3, line: 65, type: !258, isLocal: true, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "print_linelength", scope: !2, file: !3, line: 66, type: !258, isLocal: true, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "number_width", scope: !2, file: !3, line: 69, type: !60, isLocal: true, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "have_read_stdin", scope: !2, file: !3, line: 72, type: !258, isLocal: true, isDefinition: true)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "posixly_correct", scope: !2, file: !3, line: 78, type: !258, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 98, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 2304, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 9)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "format_sp_int", scope: !484, file: !3, line: 178, type: !499, isLocal: true, isDefinition: true)
!484 = distinct !DISubprogram(name: "write_counts", scope: !3, file: !3, line: 171, type: !485, scopeLine: 177, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !487)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !451, !451, !451, !451, !451, !58}
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495}
!488 = !DILocalVariable(name: "lines", arg: 1, scope: !484, file: !3, line: 171, type: !451)
!489 = !DILocalVariable(name: "words", arg: 2, scope: !484, file: !3, line: 172, type: !451)
!490 = !DILocalVariable(name: "chars", arg: 3, scope: !484, file: !3, line: 173, type: !451)
!491 = !DILocalVariable(name: "bytes", arg: 4, scope: !484, file: !3, line: 174, type: !451)
!492 = !DILocalVariable(name: "linelength", arg: 5, scope: !484, file: !3, line: 175, type: !451)
!493 = !DILocalVariable(name: "file", arg: 6, scope: !484, file: !3, line: 176, type: !58)
!494 = !DILocalVariable(name: "format_int", scope: !484, file: !3, line: 179, type: !58)
!495 = !DILocalVariable(name: "buf", scope: !484, file: !3, line: 180, type: !496)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 168, elements: !497)
!497 = !{!498}
!498 = !DISubrange(count: 21)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 40, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 5)
!502 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!503 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!504 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!505 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!506 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!507 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "Version", scope: !510, file: !511, line: 2, type: !58, isLocal: false, isDefinition: true)
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, globals: !512, splitDebugInlining: false, nameTableKind: None)
!511 = !DIFile(filename: "src/version.c", directory: "/home/philipp/GIT-Repos/coreutils")
!512 = !{!508}
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "file_name", scope: !515, file: !516, line: 46, type: !58, isLocal: true, isDefinition: true)
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !517, globals: !561, splitDebugInlining: false, nameTableKind: None)
!516 = !DIFile(filename: "lib/closeout.c", directory: "/home/philipp/GIT-Repos/coreutils")
!517 = !{!518, !52, !560, !174}
!518 = !DISubprogram(name: "close_stream", scope: !519, file: !519, line: 2, type: !520, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!519 = !DIFile(filename: "./lib/close-stream.h", directory: "/home/philipp/GIT-Repos/coreutils")
!520 = !DISubroutineType(types: !521)
!521 = !{!60, !522}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 241, size: 1728, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !523, file: !68, line: 242, baseType: !60, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !523, file: !68, line: 247, baseType: !56, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !523, file: !68, line: 248, baseType: !56, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !523, file: !68, line: 249, baseType: !56, size: 64, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !523, file: !68, line: 250, baseType: !56, size: 64, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !523, file: !68, line: 251, baseType: !56, size: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !523, file: !68, line: 252, baseType: !56, size: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !523, file: !68, line: 253, baseType: !56, size: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !523, file: !68, line: 254, baseType: !56, size: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !523, file: !68, line: 256, baseType: !56, size: 64, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !523, file: !68, line: 257, baseType: !56, size: 64, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !523, file: !68, line: 258, baseType: !56, size: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !523, file: !68, line: 260, baseType: !538, size: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !68, line: 156, size: 192, elements: !540)
!540 = !{!541, !542, !543}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !539, file: !68, line: 157, baseType: !538, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !539, file: !68, line: 158, baseType: !522, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !539, file: !68, line: 162, baseType: !60, size: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !523, file: !68, line: 262, baseType: !522, size: 64, offset: 832)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !523, file: !68, line: 264, baseType: !60, size: 32, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !523, file: !68, line: 268, baseType: !60, size: 32, offset: 928)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !523, file: !68, line: 270, baseType: !93, size: 64, offset: 960)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !523, file: !68, line: 274, baseType: !97, size: 16, offset: 1024)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !523, file: !68, line: 275, baseType: !99, size: 8, offset: 1040)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !523, file: !68, line: 276, baseType: !101, size: 8, offset: 1048)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !523, file: !68, line: 280, baseType: !105, size: 64, offset: 1088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !523, file: !68, line: 289, baseType: !108, size: 64, offset: 1152)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !523, file: !68, line: 297, baseType: !110, size: 64, offset: 1216)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !523, file: !68, line: 298, baseType: !110, size: 64, offset: 1280)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !523, file: !68, line: 299, baseType: !110, size: 64, offset: 1344)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !523, file: !68, line: 300, baseType: !110, size: 64, offset: 1408)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !523, file: !68, line: 302, baseType: !115, size: 64, offset: 1472)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !523, file: !68, line: 303, baseType: !60, size: 32, offset: 1536)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !523, file: !68, line: 305, baseType: !120, size: 160, offset: 1568)
!560 = !DISubprogram(name: "quotearg_colon", scope: !6, file: !6, line: 391, type: !135, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!561 = !{!513, !562}
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !515, file: !516, line: 56, type: !258, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "exit_failure", scope: !566, file: !567, line: 24, type: !569, isLocal: false, isDefinition: true)
!566 = distinct !DICompileUnit(language: DW_LANG_C99, file: !567, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, globals: !568, splitDebugInlining: false, nameTableKind: None)
!567 = !DIFile(filename: "lib/exitfail.c", directory: "/home/philipp/GIT-Repos/coreutils")
!568 = !{!564}
!569 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "is_basic_table", scope: !572, file: !573, line: 28, type: !577, isLocal: false, isDefinition: true)
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !574, globals: !576, splitDebugInlining: false, nameTableKind: None)
!573 = !DIFile(filename: "lib/mbchar.c", directory: "/home/philipp/GIT-Repos/coreutils")
!574 = !{!335, !575, !182}
!575 = !DISubprogram(name: "iswcntrl", scope: !332, file: !332, line: 120, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!576 = !{!570}
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 256, elements: !579)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!579 = !{!580}
!580 = !DISubrange(count: 8)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "program_name", scope: !583, file: !584, line: 33, type: !58, isLocal: false, isDefinition: true)
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !585, globals: !627, splitDebugInlining: false, nameTableKind: None)
!584 = !DIFile(filename: "lib/progname.c", directory: "/home/philipp/GIT-Repos/coreutils")
!585 = !{!110, !586, !115, !178, !180, !58, !56}
!586 = !DISubprogram(name: "fputs", scope: !63, file: !63, line: 689, type: !587, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!587 = !DISubroutineType(types: !588)
!588 = !{!60, !58, !589}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 241, size: 1728, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !590, file: !68, line: 242, baseType: !60, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !590, file: !68, line: 247, baseType: !56, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !590, file: !68, line: 248, baseType: !56, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !590, file: !68, line: 249, baseType: !56, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !590, file: !68, line: 250, baseType: !56, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !590, file: !68, line: 251, baseType: !56, size: 64, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !590, file: !68, line: 252, baseType: !56, size: 64, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !590, file: !68, line: 253, baseType: !56, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !590, file: !68, line: 254, baseType: !56, size: 64, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !590, file: !68, line: 256, baseType: !56, size: 64, offset: 576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !590, file: !68, line: 257, baseType: !56, size: 64, offset: 640)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !590, file: !68, line: 258, baseType: !56, size: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !590, file: !68, line: 260, baseType: !605, size: 64, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !68, line: 156, size: 192, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !606, file: !68, line: 157, baseType: !605, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !606, file: !68, line: 158, baseType: !589, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !606, file: !68, line: 162, baseType: !60, size: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !590, file: !68, line: 262, baseType: !589, size: 64, offset: 832)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !590, file: !68, line: 264, baseType: !60, size: 32, offset: 896)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !590, file: !68, line: 268, baseType: !60, size: 32, offset: 928)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !590, file: !68, line: 270, baseType: !93, size: 64, offset: 960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !590, file: !68, line: 274, baseType: !97, size: 16, offset: 1024)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !590, file: !68, line: 275, baseType: !99, size: 8, offset: 1040)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !590, file: !68, line: 276, baseType: !101, size: 8, offset: 1048)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !590, file: !68, line: 280, baseType: !105, size: 64, offset: 1088)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !590, file: !68, line: 289, baseType: !108, size: 64, offset: 1152)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !590, file: !68, line: 297, baseType: !110, size: 64, offset: 1216)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !590, file: !68, line: 298, baseType: !110, size: 64, offset: 1280)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !590, file: !68, line: 299, baseType: !110, size: 64, offset: 1344)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !590, file: !68, line: 300, baseType: !110, size: 64, offset: 1408)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !590, file: !68, line: 302, baseType: !115, size: 64, offset: 1472)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !590, file: !68, line: 303, baseType: !60, size: 32, offset: 1536)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !590, file: !68, line: 305, baseType: !120, size: 160, offset: 1568)
!627 = !{!581}
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !630, file: !631, line: 78, type: !714, isLocal: false, isDefinition: true)
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !632, retainedTypes: !638, globals: !687, splitDebugInlining: false, nameTableKind: None)
!631 = !DIFile(filename: "lib/quotearg.c", directory: "/home/philipp/GIT-Repos/coreutils")
!632 = !{!5, !633, !36}
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_flags", file: !6, line: 242, baseType: !7, size: 32, elements: !634)
!634 = !{!635, !636, !637}
!635 = !DIEnumerator(name: "QA_ELIDE_NULL_BYTES", value: 1, isUnsigned: true)
!636 = !DIEnumerator(name: "QA_ELIDE_OUTER_QUOTES", value: 2, isUnsigned: true)
!637 = !DIEnumerator(name: "QA_SPLIT_TRIGRAPHS", value: 4, isUnsigned: true)
!638 = !{!639, !642, !287, !656, !60, !97, !659, !115, !331, !671, !52, !676, !680, !56, !292, !269, !684}
!639 = !DISubprogram(name: "xmemdup", scope: !270, file: !270, line: 62, type: !640, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!640 = !DISubroutineType(types: !641)
!641 = !{!110, !178, !117}
!642 = !DISubprogram(name: "quotearg_alloc_mem", scope: !6, file: !6, line: 342, type: !643, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!643 = !DISubroutineType(types: !644)
!644 = !{!56, !58, !117, !645, !646}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !631, line: 58, size: 448, elements: !649)
!649 = !{!650, !651, !652, !654, !655}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !648, file: !631, line: 61, baseType: !5, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !648, file: !631, line: 64, baseType: !60, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !648, file: !631, line: 68, baseType: !653, size: 256, offset: 64)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !579)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !648, file: !631, line: 71, baseType: !58, size: 64, offset: 320)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !648, file: !631, line: 74, baseType: !58, size: 64, offset: 384)
!656 = !DISubprogram(name: "quotearg_n_custom_mem", scope: !6, file: !6, line: 408, type: !657, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!657 = !DISubroutineType(types: !658)
!658 = !{!56, !60, !58, !58, !58, !117}
!659 = !DISubprogram(name: "rpl_mbrtowc", scope: !310, file: !310, line: 747, type: !660, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!660 = !DISubroutineType(types: !661)
!661 = !{!117, !165, !58, !117, !662}
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !315, line: 82, size: 64, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !663, file: !315, line: 84, baseType: !60, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !663, file: !315, line: 93, baseType: !667, size: 32, offset: 32)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !663, file: !315, line: 85, size: 32, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !667, file: !315, line: 88, baseType: !7, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !667, file: !315, line: 92, baseType: !323, size: 32)
!671 = !DISubprogram(name: "mbsinit", scope: !315, file: !315, line: 364, type: !672, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!672 = !DISubroutineType(types: !673)
!673 = !{!60, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!676 = !DISubprogram(name: "locale_charset", scope: !677, file: !677, line: 35, type: !678, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!677 = !DIFile(filename: "./lib/localcharset.h", directory: "/home/philipp/GIT-Repos/coreutils")
!678 = !DISubroutineType(types: !679)
!679 = !{!58}
!680 = !DISubprogram(name: "c_strcasecmp", scope: !681, file: !681, line: 42, type: !682, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!681 = !DIFile(filename: "./lib/c-strcase.h", directory: "/home/philipp/GIT-Repos/coreutils")
!682 = !DISubroutineType(types: !683)
!683 = !{!60, !58, !58}
!684 = !DISubprogram(name: "xrealloc", scope: !270, file: !270, line: 59, type: !685, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!685 = !DISubroutineType(types: !686)
!686 = !{!110, !110, !117}
!687 = !{!628, !688, !694, !696, !698, !703, !710, !712}
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !630, file: !631, line: 94, type: !690, isLocal: false, isDefinition: true)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 320, elements: !692)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!692 = !{!693}
!693 = !DISubrange(count: 10)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !630, file: !631, line: 1045, type: !648, isLocal: false, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !630, file: !631, line: 109, type: !648, isLocal: true, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "slot0", scope: !630, file: !631, line: 835, type: !700, isLocal: true, isDefinition: true)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 2048, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 256)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "slotvec", scope: !630, file: !631, line: 838, type: !705, isLocal: true, isDefinition: true)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !631, line: 827, size: 128, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !706, file: !631, line: 829, baseType: !115, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !706, file: !631, line: 830, baseType: !56, size: 64, offset: 64)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "nslots", scope: !630, file: !631, line: 836, type: !60, isLocal: true, isDefinition: true)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "slotvec0", scope: !630, file: !631, line: 837, type: !706, isLocal: true, isDefinition: true)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 704, elements: !716)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!716 = !{!717}
!717 = !DISubrange(count: 11)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !720, file: !721, line: 26, type: !723, isLocal: false, isDefinition: true)
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, globals: !722, splitDebugInlining: false, nameTableKind: None)
!721 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/philipp/GIT-Repos/coreutils")
!722 = !{!718}
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 376, elements: !724)
!724 = !{!725}
!725 = !DISubrange(count: 47)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "obstack_alloc_failed_handler", scope: !728, file: !729, line: 351, type: !141, isLocal: false, isDefinition: true)
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !730, globals: !731, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "lib/obstack.c", directory: "/home/philipp/GIT-Repos/coreutils")
!730 = !{!56, !110, !52}
!731 = !{!726}
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !734, retainedTypes: !735, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "lib/argv-iter.c", directory: "/home/philipp/GIT-Repos/coreutils")
!734 = !{!20}
!735 = !{!736, !777, !110, !287}
!736 = !DISubprogram(name: "getdelim", scope: !63, file: !63, line: 668, type: !737, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!737 = !DISubroutineType(types: !738)
!738 = !{!95, !200, !645, !60, !739}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 241, size: 1728, elements: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !740, file: !68, line: 242, baseType: !60, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !740, file: !68, line: 247, baseType: !56, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !740, file: !68, line: 248, baseType: !56, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !740, file: !68, line: 249, baseType: !56, size: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !740, file: !68, line: 250, baseType: !56, size: 64, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !740, file: !68, line: 251, baseType: !56, size: 64, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !740, file: !68, line: 252, baseType: !56, size: 64, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !740, file: !68, line: 253, baseType: !56, size: 64, offset: 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !740, file: !68, line: 254, baseType: !56, size: 64, offset: 512)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !740, file: !68, line: 256, baseType: !56, size: 64, offset: 576)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !740, file: !68, line: 257, baseType: !56, size: 64, offset: 640)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !740, file: !68, line: 258, baseType: !56, size: 64, offset: 704)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !740, file: !68, line: 260, baseType: !755, size: 64, offset: 768)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !68, line: 156, size: 192, elements: !757)
!757 = !{!758, !759, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !756, file: !68, line: 157, baseType: !755, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !756, file: !68, line: 158, baseType: !739, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !756, file: !68, line: 162, baseType: !60, size: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !740, file: !68, line: 262, baseType: !739, size: 64, offset: 832)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !740, file: !68, line: 264, baseType: !60, size: 32, offset: 896)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !740, file: !68, line: 268, baseType: !60, size: 32, offset: 928)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !740, file: !68, line: 270, baseType: !93, size: 64, offset: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !740, file: !68, line: 274, baseType: !97, size: 16, offset: 1024)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !740, file: !68, line: 275, baseType: !99, size: 8, offset: 1040)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !740, file: !68, line: 276, baseType: !101, size: 8, offset: 1048)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !740, file: !68, line: 280, baseType: !105, size: 64, offset: 1088)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !740, file: !68, line: 289, baseType: !108, size: 64, offset: 1152)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !740, file: !68, line: 297, baseType: !110, size: 64, offset: 1216)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !740, file: !68, line: 298, baseType: !110, size: 64, offset: 1280)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !740, file: !68, line: 299, baseType: !110, size: 64, offset: 1344)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !740, file: !68, line: 300, baseType: !110, size: 64, offset: 1408)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !740, file: !68, line: 302, baseType: !115, size: 64, offset: 1472)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !740, file: !68, line: 303, baseType: !60, size: 32, offset: 1536)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !740, file: !68, line: 305, baseType: !120, size: 160, offset: 1568)
!777 = !DISubprogram(name: "feof", scope: !63, file: !63, line: 828, type: !778, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!778 = !DISubroutineType(types: !779)
!779 = !{!60, !739}
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !782, retainedTypes: !783, splitDebugInlining: false, nameTableKind: None)
!781 = !DIFile(filename: "lib/fadvise.c", directory: "/home/philipp/GIT-Repos/coreutils")
!782 = !{!27}
!783 = !{!784, !787}
!784 = !DISubprogram(name: "posix_fadvise", scope: !296, file: !296, line: 248, type: !785, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!785 = !DISubroutineType(types: !786)
!786 = !{!60, !60, !95, !95, !60}
!787 = !DISubprogram(name: "fileno", scope: !63, file: !63, line: 858, type: !788, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !61)
!788 = !DISubroutineType(types: !789)
!789 = !{!60, !790}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !68, line: 241, size: 1728, elements: !792)
!792 = !{!793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !791, file: !68, line: 242, baseType: !60, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !791, file: !68, line: 247, baseType: !56, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !791, file: !68, line: 248, baseType: !56, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !791, file: !68, line: 249, baseType: !56, size: 64, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !791, file: !68, line: 250, baseType: !56, size: 64, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !791, file: !68, line: 251, baseType: !56, size: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !791, file: !68, line: 252, baseType: !56, size: 64, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !791, file: !68, line: 253, baseType: !56, size: 64, offset: 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !791, file: !68, line: 254, baseType: !56, size: 64, offset: 512)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !791, file: !68, line: 256, baseType: !56, size: 64, offset: 576)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !791, file: !68, line: 257, baseType: !56, size: 64, offset: 640)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !791, file: !68, line: 258, baseType: !56, size: 64, offset: 704)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !791, file: !68, line: 260, baseType: !806, size: 64, offset: 768)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !68, line: 156, size: 192, elements: !808)
!808 = !{!809, !810, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !807, file: !68, line: 157, baseType: !806, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !807, file: !68, line: 158, baseType: !790, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !807, file: !68, line: 162, baseType: !60, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !791, file: !68, line: 262, baseType: !790, size: 64, offset: 832)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !791, file: !68, line: 264, baseType: !60, size: 32, offset: 896)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !791, file: !68, line: 268, baseType: !60, size: 32, offset: 928)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !791, file: !68, line: 270, baseType: !93, size: 64, offset: 960)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !791, file: !68, line: 274, baseType: !97, size: 16, offset: 1024)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !791, file: !68, line: 275, baseType: !99, size: 8, offset: 1040)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !791, file: !68, line: 276, baseType: !101, size: 8, offset: 1048)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !791, file: !68, line: 280, baseType: !105, size: 64, offset: 1088)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !791, file: !68, line: 289, baseType: !108, size: 64, offset: 1152)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !791, file: !68, line: 297, baseType: !110, size: 64, offset: 1216)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !791, file: !68, line: 298, baseType: !110, size: 64, offset: 1280)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !791, file: !68, line: 299, baseType: !110, size: 64, offset: 1344)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !791, file: !68, line: 300, baseType: !110, size: 64, offset: 1408)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !791, file: !68, line: 302, baseType: !115, size: 64, offset: 1472)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !791, file: !68, line: 303, baseType: !60, size: 32, offset: 1536)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !791, file: !68, line: 305, baseType: !120, size: 160, offset: 1568)
!828 = distinct !DICompileUnit(language: DW_LANG_C99, file: !829, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !830, splitDebugInlining: false, nameTableKind: None)
!829 = !DIFile(filename: "lib/umaxtostr.c", directory: "/home/philipp/GIT-Repos/coreutils")
!830 = !{!451}
!831 = distinct !DICompileUnit(language: DW_LANG_C99, file: !832, producer: "clang version 10.0.0 (https://github.com/llvm/llvm-project.git d32170dbd5b0d54436537b6b75beaf44324e0c28)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !833, retainedTypes: !1052, splitDebugInlining: false, nameTableKind: None)
!832 = !DIFile(filename: "lib/physmem.c", directory: "/home/philipp/GIT-Repos/coreutils")
!833 = !{!834}
!834 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !835, line: 71, baseType: !7, size: 32, elements: !836)
!835 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/confname.h", directory: "")
!836 = !{!837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051}
!837 = !DIEnumerator(name: "_SC_ARG_MAX", value: 0, isUnsigned: true)
!838 = !DIEnumerator(name: "_SC_CHILD_MAX", value: 1, isUnsigned: true)
!839 = !DIEnumerator(name: "_SC_CLK_TCK", value: 2, isUnsigned: true)
!840 = !DIEnumerator(name: "_SC_NGROUPS_MAX", value: 3, isUnsigned: true)
!841 = !DIEnumerator(name: "_SC_OPEN_MAX", value: 4, isUnsigned: true)
!842 = !DIEnumerator(name: "_SC_STREAM_MAX", value: 5, isUnsigned: true)
!843 = !DIEnumerator(name: "_SC_TZNAME_MAX", value: 6, isUnsigned: true)
!844 = !DIEnumerator(name: "_SC_JOB_CONTROL", value: 7, isUnsigned: true)
!845 = !DIEnumerator(name: "_SC_SAVED_IDS", value: 8, isUnsigned: true)
!846 = !DIEnumerator(name: "_SC_REALTIME_SIGNALS", value: 9, isUnsigned: true)
!847 = !DIEnumerator(name: "_SC_PRIORITY_SCHEDULING", value: 10, isUnsigned: true)
!848 = !DIEnumerator(name: "_SC_TIMERS", value: 11, isUnsigned: true)
!849 = !DIEnumerator(name: "_SC_ASYNCHRONOUS_IO", value: 12, isUnsigned: true)
!850 = !DIEnumerator(name: "_SC_PRIORITIZED_IO", value: 13, isUnsigned: true)
!851 = !DIEnumerator(name: "_SC_SYNCHRONIZED_IO", value: 14, isUnsigned: true)
!852 = !DIEnumerator(name: "_SC_FSYNC", value: 15, isUnsigned: true)
!853 = !DIEnumerator(name: "_SC_MAPPED_FILES", value: 16, isUnsigned: true)
!854 = !DIEnumerator(name: "_SC_MEMLOCK", value: 17, isUnsigned: true)
!855 = !DIEnumerator(name: "_SC_MEMLOCK_RANGE", value: 18, isUnsigned: true)
!856 = !DIEnumerator(name: "_SC_MEMORY_PROTECTION", value: 19, isUnsigned: true)
!857 = !DIEnumerator(name: "_SC_MESSAGE_PASSING", value: 20, isUnsigned: true)
!858 = !DIEnumerator(name: "_SC_SEMAPHORES", value: 21, isUnsigned: true)
!859 = !DIEnumerator(name: "_SC_SHARED_MEMORY_OBJECTS", value: 22, isUnsigned: true)
!860 = !DIEnumerator(name: "_SC_AIO_LISTIO_MAX", value: 23, isUnsigned: true)
!861 = !DIEnumerator(name: "_SC_AIO_MAX", value: 24, isUnsigned: true)
!862 = !DIEnumerator(name: "_SC_AIO_PRIO_DELTA_MAX", value: 25, isUnsigned: true)
!863 = !DIEnumerator(name: "_SC_DELAYTIMER_MAX", value: 26, isUnsigned: true)
!864 = !DIEnumerator(name: "_SC_MQ_OPEN_MAX", value: 27, isUnsigned: true)
!865 = !DIEnumerator(name: "_SC_MQ_PRIO_MAX", value: 28, isUnsigned: true)
!866 = !DIEnumerator(name: "_SC_VERSION", value: 29, isUnsigned: true)
!867 = !DIEnumerator(name: "_SC_PAGESIZE", value: 30, isUnsigned: true)
!868 = !DIEnumerator(name: "_SC_RTSIG_MAX", value: 31, isUnsigned: true)
!869 = !DIEnumerator(name: "_SC_SEM_NSEMS_MAX", value: 32, isUnsigned: true)
!870 = !DIEnumerator(name: "_SC_SEM_VALUE_MAX", value: 33, isUnsigned: true)
!871 = !DIEnumerator(name: "_SC_SIGQUEUE_MAX", value: 34, isUnsigned: true)
!872 = !DIEnumerator(name: "_SC_TIMER_MAX", value: 35, isUnsigned: true)
!873 = !DIEnumerator(name: "_SC_BC_BASE_MAX", value: 36, isUnsigned: true)
!874 = !DIEnumerator(name: "_SC_BC_DIM_MAX", value: 37, isUnsigned: true)
!875 = !DIEnumerator(name: "_SC_BC_SCALE_MAX", value: 38, isUnsigned: true)
!876 = !DIEnumerator(name: "_SC_BC_STRING_MAX", value: 39, isUnsigned: true)
!877 = !DIEnumerator(name: "_SC_COLL_WEIGHTS_MAX", value: 40, isUnsigned: true)
!878 = !DIEnumerator(name: "_SC_EQUIV_CLASS_MAX", value: 41, isUnsigned: true)
!879 = !DIEnumerator(name: "_SC_EXPR_NEST_MAX", value: 42, isUnsigned: true)
!880 = !DIEnumerator(name: "_SC_LINE_MAX", value: 43, isUnsigned: true)
!881 = !DIEnumerator(name: "_SC_RE_DUP_MAX", value: 44, isUnsigned: true)
!882 = !DIEnumerator(name: "_SC_CHARCLASS_NAME_MAX", value: 45, isUnsigned: true)
!883 = !DIEnumerator(name: "_SC_2_VERSION", value: 46, isUnsigned: true)
!884 = !DIEnumerator(name: "_SC_2_C_BIND", value: 47, isUnsigned: true)
!885 = !DIEnumerator(name: "_SC_2_C_DEV", value: 48, isUnsigned: true)
!886 = !DIEnumerator(name: "_SC_2_FORT_DEV", value: 49, isUnsigned: true)
!887 = !DIEnumerator(name: "_SC_2_FORT_RUN", value: 50, isUnsigned: true)
!888 = !DIEnumerator(name: "_SC_2_SW_DEV", value: 51, isUnsigned: true)
!889 = !DIEnumerator(name: "_SC_2_LOCALEDEF", value: 52, isUnsigned: true)
!890 = !DIEnumerator(name: "_SC_PII", value: 53, isUnsigned: true)
!891 = !DIEnumerator(name: "_SC_PII_XTI", value: 54, isUnsigned: true)
!892 = !DIEnumerator(name: "_SC_PII_SOCKET", value: 55, isUnsigned: true)
!893 = !DIEnumerator(name: "_SC_PII_INTERNET", value: 56, isUnsigned: true)
!894 = !DIEnumerator(name: "_SC_PII_OSI", value: 57, isUnsigned: true)
!895 = !DIEnumerator(name: "_SC_POLL", value: 58, isUnsigned: true)
!896 = !DIEnumerator(name: "_SC_SELECT", value: 59, isUnsigned: true)
!897 = !DIEnumerator(name: "_SC_UIO_MAXIOV", value: 60, isUnsigned: true)
!898 = !DIEnumerator(name: "_SC_IOV_MAX", value: 60, isUnsigned: true)
!899 = !DIEnumerator(name: "_SC_PII_INTERNET_STREAM", value: 61, isUnsigned: true)
!900 = !DIEnumerator(name: "_SC_PII_INTERNET_DGRAM", value: 62, isUnsigned: true)
!901 = !DIEnumerator(name: "_SC_PII_OSI_COTS", value: 63, isUnsigned: true)
!902 = !DIEnumerator(name: "_SC_PII_OSI_CLTS", value: 64, isUnsigned: true)
!903 = !DIEnumerator(name: "_SC_PII_OSI_M", value: 65, isUnsigned: true)
!904 = !DIEnumerator(name: "_SC_T_IOV_MAX", value: 66, isUnsigned: true)
!905 = !DIEnumerator(name: "_SC_THREADS", value: 67, isUnsigned: true)
!906 = !DIEnumerator(name: "_SC_THREAD_SAFE_FUNCTIONS", value: 68, isUnsigned: true)
!907 = !DIEnumerator(name: "_SC_GETGR_R_SIZE_MAX", value: 69, isUnsigned: true)
!908 = !DIEnumerator(name: "_SC_GETPW_R_SIZE_MAX", value: 70, isUnsigned: true)
!909 = !DIEnumerator(name: "_SC_LOGIN_NAME_MAX", value: 71, isUnsigned: true)
!910 = !DIEnumerator(name: "_SC_TTY_NAME_MAX", value: 72, isUnsigned: true)
!911 = !DIEnumerator(name: "_SC_THREAD_DESTRUCTOR_ITERATIONS", value: 73, isUnsigned: true)
!912 = !DIEnumerator(name: "_SC_THREAD_KEYS_MAX", value: 74, isUnsigned: true)
!913 = !DIEnumerator(name: "_SC_THREAD_STACK_MIN", value: 75, isUnsigned: true)
!914 = !DIEnumerator(name: "_SC_THREAD_THREADS_MAX", value: 76, isUnsigned: true)
!915 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKADDR", value: 77, isUnsigned: true)
!916 = !DIEnumerator(name: "_SC_THREAD_ATTR_STACKSIZE", value: 78, isUnsigned: true)
!917 = !DIEnumerator(name: "_SC_THREAD_PRIORITY_SCHEDULING", value: 79, isUnsigned: true)
!918 = !DIEnumerator(name: "_SC_THREAD_PRIO_INHERIT", value: 80, isUnsigned: true)
!919 = !DIEnumerator(name: "_SC_THREAD_PRIO_PROTECT", value: 81, isUnsigned: true)
!920 = !DIEnumerator(name: "_SC_THREAD_PROCESS_SHARED", value: 82, isUnsigned: true)
!921 = !DIEnumerator(name: "_SC_NPROCESSORS_CONF", value: 83, isUnsigned: true)
!922 = !DIEnumerator(name: "_SC_NPROCESSORS_ONLN", value: 84, isUnsigned: true)
!923 = !DIEnumerator(name: "_SC_PHYS_PAGES", value: 85, isUnsigned: true)
!924 = !DIEnumerator(name: "_SC_AVPHYS_PAGES", value: 86, isUnsigned: true)
!925 = !DIEnumerator(name: "_SC_ATEXIT_MAX", value: 87, isUnsigned: true)
!926 = !DIEnumerator(name: "_SC_PASS_MAX", value: 88, isUnsigned: true)
!927 = !DIEnumerator(name: "_SC_XOPEN_VERSION", value: 89, isUnsigned: true)
!928 = !DIEnumerator(name: "_SC_XOPEN_XCU_VERSION", value: 90, isUnsigned: true)
!929 = !DIEnumerator(name: "_SC_XOPEN_UNIX", value: 91, isUnsigned: true)
!930 = !DIEnumerator(name: "_SC_XOPEN_CRYPT", value: 92, isUnsigned: true)
!931 = !DIEnumerator(name: "_SC_XOPEN_ENH_I18N", value: 93, isUnsigned: true)
!932 = !DIEnumerator(name: "_SC_XOPEN_SHM", value: 94, isUnsigned: true)
!933 = !DIEnumerator(name: "_SC_2_CHAR_TERM", value: 95, isUnsigned: true)
!934 = !DIEnumerator(name: "_SC_2_C_VERSION", value: 96, isUnsigned: true)
!935 = !DIEnumerator(name: "_SC_2_UPE", value: 97, isUnsigned: true)
!936 = !DIEnumerator(name: "_SC_XOPEN_XPG2", value: 98, isUnsigned: true)
!937 = !DIEnumerator(name: "_SC_XOPEN_XPG3", value: 99, isUnsigned: true)
!938 = !DIEnumerator(name: "_SC_XOPEN_XPG4", value: 100, isUnsigned: true)
!939 = !DIEnumerator(name: "_SC_CHAR_BIT", value: 101, isUnsigned: true)
!940 = !DIEnumerator(name: "_SC_CHAR_MAX", value: 102, isUnsigned: true)
!941 = !DIEnumerator(name: "_SC_CHAR_MIN", value: 103, isUnsigned: true)
!942 = !DIEnumerator(name: "_SC_INT_MAX", value: 104, isUnsigned: true)
!943 = !DIEnumerator(name: "_SC_INT_MIN", value: 105, isUnsigned: true)
!944 = !DIEnumerator(name: "_SC_LONG_BIT", value: 106, isUnsigned: true)
!945 = !DIEnumerator(name: "_SC_WORD_BIT", value: 107, isUnsigned: true)
!946 = !DIEnumerator(name: "_SC_MB_LEN_MAX", value: 108, isUnsigned: true)
!947 = !DIEnumerator(name: "_SC_NZERO", value: 109, isUnsigned: true)
!948 = !DIEnumerator(name: "_SC_SSIZE_MAX", value: 110, isUnsigned: true)
!949 = !DIEnumerator(name: "_SC_SCHAR_MAX", value: 111, isUnsigned: true)
!950 = !DIEnumerator(name: "_SC_SCHAR_MIN", value: 112, isUnsigned: true)
!951 = !DIEnumerator(name: "_SC_SHRT_MAX", value: 113, isUnsigned: true)
!952 = !DIEnumerator(name: "_SC_SHRT_MIN", value: 114, isUnsigned: true)
!953 = !DIEnumerator(name: "_SC_UCHAR_MAX", value: 115, isUnsigned: true)
!954 = !DIEnumerator(name: "_SC_UINT_MAX", value: 116, isUnsigned: true)
!955 = !DIEnumerator(name: "_SC_ULONG_MAX", value: 117, isUnsigned: true)
!956 = !DIEnumerator(name: "_SC_USHRT_MAX", value: 118, isUnsigned: true)
!957 = !DIEnumerator(name: "_SC_NL_ARGMAX", value: 119, isUnsigned: true)
!958 = !DIEnumerator(name: "_SC_NL_LANGMAX", value: 120, isUnsigned: true)
!959 = !DIEnumerator(name: "_SC_NL_MSGMAX", value: 121, isUnsigned: true)
!960 = !DIEnumerator(name: "_SC_NL_NMAX", value: 122, isUnsigned: true)
!961 = !DIEnumerator(name: "_SC_NL_SETMAX", value: 123, isUnsigned: true)
!962 = !DIEnumerator(name: "_SC_NL_TEXTMAX", value: 124, isUnsigned: true)
!963 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFF32", value: 125, isUnsigned: true)
!964 = !DIEnumerator(name: "_SC_XBS5_ILP32_OFFBIG", value: 126, isUnsigned: true)
!965 = !DIEnumerator(name: "_SC_XBS5_LP64_OFF64", value: 127, isUnsigned: true)
!966 = !DIEnumerator(name: "_SC_XBS5_LPBIG_OFFBIG", value: 128, isUnsigned: true)
!967 = !DIEnumerator(name: "_SC_XOPEN_LEGACY", value: 129, isUnsigned: true)
!968 = !DIEnumerator(name: "_SC_XOPEN_REALTIME", value: 130, isUnsigned: true)
!969 = !DIEnumerator(name: "_SC_XOPEN_REALTIME_THREADS", value: 131, isUnsigned: true)
!970 = !DIEnumerator(name: "_SC_ADVISORY_INFO", value: 132, isUnsigned: true)
!971 = !DIEnumerator(name: "_SC_BARRIERS", value: 133, isUnsigned: true)
!972 = !DIEnumerator(name: "_SC_BASE", value: 134, isUnsigned: true)
!973 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT", value: 135, isUnsigned: true)
!974 = !DIEnumerator(name: "_SC_C_LANG_SUPPORT_R", value: 136, isUnsigned: true)
!975 = !DIEnumerator(name: "_SC_CLOCK_SELECTION", value: 137, isUnsigned: true)
!976 = !DIEnumerator(name: "_SC_CPUTIME", value: 138, isUnsigned: true)
!977 = !DIEnumerator(name: "_SC_THREAD_CPUTIME", value: 139, isUnsigned: true)
!978 = !DIEnumerator(name: "_SC_DEVICE_IO", value: 140, isUnsigned: true)
!979 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC", value: 141, isUnsigned: true)
!980 = !DIEnumerator(name: "_SC_DEVICE_SPECIFIC_R", value: 142, isUnsigned: true)
!981 = !DIEnumerator(name: "_SC_FD_MGMT", value: 143, isUnsigned: true)
!982 = !DIEnumerator(name: "_SC_FIFO", value: 144, isUnsigned: true)
!983 = !DIEnumerator(name: "_SC_PIPE", value: 145, isUnsigned: true)
!984 = !DIEnumerator(name: "_SC_FILE_ATTRIBUTES", value: 146, isUnsigned: true)
!985 = !DIEnumerator(name: "_SC_FILE_LOCKING", value: 147, isUnsigned: true)
!986 = !DIEnumerator(name: "_SC_FILE_SYSTEM", value: 148, isUnsigned: true)
!987 = !DIEnumerator(name: "_SC_MONOTONIC_CLOCK", value: 149, isUnsigned: true)
!988 = !DIEnumerator(name: "_SC_MULTI_PROCESS", value: 150, isUnsigned: true)
!989 = !DIEnumerator(name: "_SC_SINGLE_PROCESS", value: 151, isUnsigned: true)
!990 = !DIEnumerator(name: "_SC_NETWORKING", value: 152, isUnsigned: true)
!991 = !DIEnumerator(name: "_SC_READER_WRITER_LOCKS", value: 153, isUnsigned: true)
!992 = !DIEnumerator(name: "_SC_SPIN_LOCKS", value: 154, isUnsigned: true)
!993 = !DIEnumerator(name: "_SC_REGEXP", value: 155, isUnsigned: true)
!994 = !DIEnumerator(name: "_SC_REGEX_VERSION", value: 156, isUnsigned: true)
!995 = !DIEnumerator(name: "_SC_SHELL", value: 157, isUnsigned: true)
!996 = !DIEnumerator(name: "_SC_SIGNALS", value: 158, isUnsigned: true)
!997 = !DIEnumerator(name: "_SC_SPAWN", value: 159, isUnsigned: true)
!998 = !DIEnumerator(name: "_SC_SPORADIC_SERVER", value: 160, isUnsigned: true)
!999 = !DIEnumerator(name: "_SC_THREAD_SPORADIC_SERVER", value: 161, isUnsigned: true)
!1000 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE", value: 162, isUnsigned: true)
!1001 = !DIEnumerator(name: "_SC_SYSTEM_DATABASE_R", value: 163, isUnsigned: true)
!1002 = !DIEnumerator(name: "_SC_TIMEOUTS", value: 164, isUnsigned: true)
!1003 = !DIEnumerator(name: "_SC_TYPED_MEMORY_OBJECTS", value: 165, isUnsigned: true)
!1004 = !DIEnumerator(name: "_SC_USER_GROUPS", value: 166, isUnsigned: true)
!1005 = !DIEnumerator(name: "_SC_USER_GROUPS_R", value: 167, isUnsigned: true)
!1006 = !DIEnumerator(name: "_SC_2_PBS", value: 168, isUnsigned: true)
!1007 = !DIEnumerator(name: "_SC_2_PBS_ACCOUNTING", value: 169, isUnsigned: true)
!1008 = !DIEnumerator(name: "_SC_2_PBS_LOCATE", value: 170, isUnsigned: true)
!1009 = !DIEnumerator(name: "_SC_2_PBS_MESSAGE", value: 171, isUnsigned: true)
!1010 = !DIEnumerator(name: "_SC_2_PBS_TRACK", value: 172, isUnsigned: true)
!1011 = !DIEnumerator(name: "_SC_SYMLOOP_MAX", value: 173, isUnsigned: true)
!1012 = !DIEnumerator(name: "_SC_STREAMS", value: 174, isUnsigned: true)
!1013 = !DIEnumerator(name: "_SC_2_PBS_CHECKPOINT", value: 175, isUnsigned: true)
!1014 = !DIEnumerator(name: "_SC_V6_ILP32_OFF32", value: 176, isUnsigned: true)
!1015 = !DIEnumerator(name: "_SC_V6_ILP32_OFFBIG", value: 177, isUnsigned: true)
!1016 = !DIEnumerator(name: "_SC_V6_LP64_OFF64", value: 178, isUnsigned: true)
!1017 = !DIEnumerator(name: "_SC_V6_LPBIG_OFFBIG", value: 179, isUnsigned: true)
!1018 = !DIEnumerator(name: "_SC_HOST_NAME_MAX", value: 180, isUnsigned: true)
!1019 = !DIEnumerator(name: "_SC_TRACE", value: 181, isUnsigned: true)
!1020 = !DIEnumerator(name: "_SC_TRACE_EVENT_FILTER", value: 182, isUnsigned: true)
!1021 = !DIEnumerator(name: "_SC_TRACE_INHERIT", value: 183, isUnsigned: true)
!1022 = !DIEnumerator(name: "_SC_TRACE_LOG", value: 184, isUnsigned: true)
!1023 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_SIZE", value: 185, isUnsigned: true)
!1024 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_ASSOC", value: 186, isUnsigned: true)
!1025 = !DIEnumerator(name: "_SC_LEVEL1_ICACHE_LINESIZE", value: 187, isUnsigned: true)
!1026 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_SIZE", value: 188, isUnsigned: true)
!1027 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_ASSOC", value: 189, isUnsigned: true)
!1028 = !DIEnumerator(name: "_SC_LEVEL1_DCACHE_LINESIZE", value: 190, isUnsigned: true)
