; ModuleID = 'dnsproxy.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.request = type { i16, %struct.sockaddr_in, i16, i8, %struct.event, %struct.request**, %struct.request* }
%struct.event = type { %struct.event_callback, %union.anon.0, i32, %struct.event_base*, %union.anon.2, i16, i16, %struct.timeval }
%struct.event_callback = type { %struct.anon, i16, i8, i8, %union.anon, i8* }
%struct.anon = type { %struct.event_callback*, %struct.event_callback** }
%union.anon = type { void (i32, i16, i8*)* }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { %struct.event*, %struct.event** }
%struct.event_base = type opaque
%union.anon.2 = type { %struct.anon.3 }
%struct.anon.3 = type { %struct.anon.1, %struct.timeval }
%struct.timeval = type { i64, i64 }
%struct.internal = type { i32, i32, %struct.internal* }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "authoritative_port", scope: !2, file: !124, line: 76, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.1 (https://github.com/llvm/llvm-project.git fed41342a82f5a3a9201819a82bf7a48313e296b)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !18, globals: !154, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "dnsproxy.c", directory: "/nobackup/klee_LLVM_12/dnsproxy")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !6, line: 24, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17}
!9 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!13 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!14 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!15 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!16 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!17 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!18 = !{!19, !32, !33, !7, !122, !153}
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !21, line: 178, size: 128, elements: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!22 = !{!23, !27}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !20, file: !21, line: 180, baseType: !24, size: 16)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !25, line: 28, baseType: !26)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !20, file: !21, line: 181, baseType: !28, size: 112, offset: 16)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 112, elements: !30)
!29 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!30 = !{!31}
!31 = !DISubrange(count: 14)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !35, line: 123, size: 1024, elements: !36)
!35 = !DIFile(filename: "/usr/include/event2/event_struct.h", directory: "")
!36 = !{!37, !74, !84, !85, !88, !119, !120, !121}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !34, file: !35, line: 124, baseType: !38, size: 320)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !35, line: 107, size: 320, elements: !39)
!39 = !{!40, !47, !49, !55, !56, !73}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !38, file: !35, line: 108, baseType: !41, size: 128)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !38, file: !35, line: 108, size: 128, elements: !42)
!42 = !{!43, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !41, file: !35, line: 108, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !41, file: !35, line: 108, baseType: !46, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !38, file: !35, line: 109, baseType: !48, size: 16, offset: 128)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !38, file: !35, line: 110, baseType: !50, size: 8, offset: 144)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !51, line: 24, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !53, line: 38, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!54 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !38, file: !35, line: 111, baseType: !50, size: 8, offset: 152)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !38, file: !35, line: 118, baseType: !57, size: 64, offset: 192)
!57 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !38, file: !35, line: 113, size: 64, elements: !58)
!58 = !{!59, !64, !68, !72}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !57, file: !35, line: 114, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !63, !48, !32}
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !57, file: !35, line: 115, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !44, !32}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !57, file: !35, line: 116, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !33, !32}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !57, file: !35, line: 117, baseType: !65, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !38, file: !35, line: 119, baseType: !32, size: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !34, file: !35, line: 130, baseType: !75, size: 128, offset: 320)
!75 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !34, file: !35, line: 127, size: 128, elements: !76)
!76 = !{!77, !83}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !75, file: !35, line: 128, baseType: !78, size: 128)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !75, file: !35, line: 128, size: 128, elements: !79)
!79 = !{!80, !81}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !78, file: !35, line: 128, baseType: !33, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !78, file: !35, line: 128, baseType: !82, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !75, file: !35, line: 129, baseType: !63, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !34, file: !35, line: 131, baseType: !63, size: 32, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !34, file: !35, line: 133, baseType: !86, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "event_base", file: !35, line: 122, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !34, file: !35, line: 149, baseType: !89, size: 256, offset: 576)
!89 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !34, file: !35, line: 135, size: 256, elements: !90)
!90 = !{!91, !108}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !89, file: !35, line: 140, baseType: !92, size: 256)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !89, file: !35, line: 137, size: 256, elements: !93)
!93 = !{!94, !99}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !92, file: !35, line: 138, baseType: !95, size: 128)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !35, line: 138, size: 128, elements: !96)
!96 = !{!97, !98}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !95, file: !35, line: 138, baseType: !33, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !95, file: !35, line: 138, baseType: !82, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !92, file: !35, line: 139, baseType: !100, size: 128, offset: 128)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !101, line: 8, size: 128, elements: !102)
!101 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "")
!102 = !{!103, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !100, file: !101, line: 10, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !53, line: 160, baseType: !105)
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !100, file: !101, line: 11, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !53, line: 162, baseType: !105)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !89, file: !35, line: 148, baseType: !109, size: 256)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !89, file: !35, line: 143, size: 256, elements: !110)
!110 = !{!111, !116, !117}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !109, file: !35, line: 144, baseType: !112, size: 128)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !109, file: !35, line: 144, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !112, file: !35, line: 144, baseType: !33, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !112, file: !35, line: 144, baseType: !82, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !109, file: !35, line: 145, baseType: !48, size: 16, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !109, file: !35, line: 147, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !34, file: !35, line: 151, baseType: !48, size: 16, offset: 832)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !34, file: !35, line: 152, baseType: !48, size: 16, offset: 848)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !34, file: !35, line: 153, baseType: !100, size: 128, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "request", file: !124, line: 63, size: 1344, elements: !125)
!124 = !DIFile(filename: "./dnsproxy.h", directory: "/nobackup/klee_LLVM_12/dnsproxy")
!125 = !{!126, !127, !147, !148, !149, !150, !152}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !123, file: !124, line: 64, baseType: !26, size: 16)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !123, file: !124, line: 66, baseType: !128, size: 128, offset: 32)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !129, line: 238, size: 128, elements: !130)
!129 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!130 = !{!131, !132, !136, !143}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !128, file: !129, line: 240, baseType: !24, size: 16)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !128, file: !129, line: 241, baseType: !133, size: 16, offset: 16)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !129, line: 119, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !51, line: 25, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !53, line: 40, baseType: !26)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !128, file: !129, line: 242, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !129, line: 31, size: 32, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !137, file: !129, line: 33, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !129, line: 30, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !51, line: 26, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !53, line: 42, baseType: !7)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !128, file: !129, line: 245, baseType: !144, size: 64, offset: 64)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 64, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 8)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "clientid", scope: !123, file: !124, line: 67, baseType: !26, size: 16, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "recursion", scope: !123, file: !124, line: 68, baseType: !54, size: 8, offset: 176)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !123, file: !124, line: 70, baseType: !34, size: 1024, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !123, file: !124, line: 72, baseType: !151, size: 64, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !123, file: !124, line: 73, baseType: !122, size: 64, offset: 1280)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!154 = !{!0, !155, !157, !159, !161, !163, !165, !168, !170, !172, !174, !176, !179, !181, !183, !185, !187, !189, !191, !193, !195, !197, !199, !201, !203, !205}
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "authoritative_timeout", scope: !2, file: !124, line: 77, type: !7, isLocal: false, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "recursive_port", scope: !2, file: !124, line: 78, type: !7, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "recursive_timeout", scope: !2, file: !124, line: 79, type: !7, isLocal: false, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "stats_timeout", scope: !2, file: !124, line: 80, type: !7, isLocal: false, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "port", scope: !2, file: !124, line: 81, type: !7, isLocal: false, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "authoritative", scope: !2, file: !124, line: 83, type: !167, isLocal: false, isDefinition: true)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "chrootdir", scope: !2, file: !124, line: 84, type: !167, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "listenat", scope: !2, file: !124, line: 85, type: !167, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "recursive", scope: !2, file: !124, line: 86, type: !167, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "user", scope: !2, file: !124, line: 87, type: !167, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "active_queries", scope: !2, file: !124, line: 89, type: !178, isLocal: false, isDefinition: true)
!178 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "all_queries", scope: !2, file: !124, line: 90, type: !178, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "authoritative_queries", scope: !2, file: !124, line: 91, type: !178, isLocal: false, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "recursive_queries", scope: !2, file: !124, line: 92, type: !178, isLocal: false, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "removed_queries", scope: !2, file: !124, line: 93, type: !178, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "dropped_queries", scope: !2, file: !124, line: 94, type: !178, isLocal: false, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "answered_queries", scope: !2, file: !124, line: 95, type: !178, isLocal: false, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "dropped_answers", scope: !2, file: !124, line: 96, type: !178, isLocal: false, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "late_answers", scope: !2, file: !124, line: 97, type: !178, isLocal: false, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "hash_collisions", scope: !2, file: !124, line: 98, type: !178, isLocal: false, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "authoritative_addr", scope: !2, file: !3, line: 41, type: !128, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "recursive_addr", scope: !2, file: !3, line: 42, type: !128, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "sock_query", scope: !2, file: !3, line: 43, type: !63, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "sock_answer", scope: !2, file: !3, line: 44, type: !63, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "queryid", scope: !2, file: !3, line: 38, type: !26, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "request_hash", scope: !209, file: !210, line: 29, type: !214, isLocal: true, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "clang version 12.0.1 (https://github.com/llvm/llvm-project.git fed41342a82f5a3a9201819a82bf7a48313e296b)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !212, globals: !213, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "hash.c", directory: "/nobackup/klee_LLVM_12/dnsproxy")
!211 = !{}
!212 = !{!32}
!213 = !{!207}
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 65536, elements: !306)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "request", file: !124, line: 63, size: 1344, elements: !217)
!217 = !{!218, !219, !229, !230, !231, !303, !305}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !216, file: !124, line: 64, baseType: !26, size: 16)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "client", scope: !216, file: !124, line: 66, baseType: !220, size: 128, offset: 32)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !129, line: 238, size: 128, elements: !221)
!221 = !{!222, !223, !224, !228}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !220, file: !129, line: 240, baseType: !24, size: 16)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !220, file: !129, line: 241, baseType: !133, size: 16, offset: 16)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !220, file: !129, line: 242, baseType: !225, size: 32, offset: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !129, line: 31, size: 32, elements: !226)
!226 = !{!227}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !225, file: !129, line: 33, baseType: !140, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !220, file: !129, line: 245, baseType: !144, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "clientid", scope: !216, file: !124, line: 67, baseType: !26, size: 16, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "recursion", scope: !216, file: !124, line: 68, baseType: !54, size: 8, offset: 176)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !216, file: !124, line: 70, baseType: !232, size: 1024, offset: 192)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !35, line: 123, size: 1024, elements: !233)
!233 = !{!234, !262, !272, !273, !274, !300, !301, !302}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !232, file: !35, line: 124, baseType: !235, size: 320)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !35, line: 107, size: 320, elements: !236)
!236 = !{!237, !244, !245, !246, !247, !261}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !235, file: !35, line: 108, baseType: !238, size: 128)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !35, line: 108, size: 128, elements: !239)
!239 = !{!240, !242}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !238, file: !35, line: 108, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !238, file: !35, line: 108, baseType: !243, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !235, file: !35, line: 109, baseType: !48, size: 16, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !235, file: !35, line: 110, baseType: !50, size: 8, offset: 144)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !235, file: !35, line: 111, baseType: !50, size: 8, offset: 152)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !235, file: !35, line: 118, baseType: !248, size: 64, offset: 192)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !35, line: 113, size: 64, elements: !249)
!249 = !{!250, !251, !255, !260}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !248, file: !35, line: 114, baseType: !60, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !248, file: !35, line: 115, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !241, !32}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !248, file: !35, line: 116, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !259, !32}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !248, file: !35, line: 117, baseType: !252, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !235, file: !35, line: 119, baseType: !32, size: 64, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !232, file: !35, line: 130, baseType: !263, size: 128, offset: 320)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !35, line: 127, size: 128, elements: !264)
!264 = !{!265, !271}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !263, file: !35, line: 128, baseType: !266, size: 128)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !35, line: 128, size: 128, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !266, file: !35, line: 128, baseType: !259, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !266, file: !35, line: 128, baseType: !270, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !263, file: !35, line: 129, baseType: !63, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !232, file: !35, line: 131, baseType: !63, size: 32, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !232, file: !35, line: 133, baseType: !86, size: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !232, file: !35, line: 149, baseType: !275, size: 256, offset: 576)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !232, file: !35, line: 135, size: 256, elements: !276)
!276 = !{!277, !290}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !275, file: !35, line: 140, baseType: !278, size: 256)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !275, file: !35, line: 137, size: 256, elements: !279)
!279 = !{!280, !285}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !278, file: !35, line: 138, baseType: !281, size: 128)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !278, file: !35, line: 138, size: 128, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !281, file: !35, line: 138, baseType: !259, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !281, file: !35, line: 138, baseType: !270, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !278, file: !35, line: 139, baseType: !286, size: 128, offset: 128)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !101, line: 8, size: 128, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !286, file: !101, line: 10, baseType: !104, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !286, file: !101, line: 11, baseType: !107, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !275, file: !35, line: 148, baseType: !291, size: 256)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !275, file: !35, line: 143, size: 256, elements: !292)
!292 = !{!293, !298, !299}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !291, file: !35, line: 144, baseType: !294, size: 128)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !35, line: 144, size: 128, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !294, file: !35, line: 144, baseType: !259, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !294, file: !35, line: 144, baseType: !270, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !291, file: !35, line: 145, baseType: !48, size: 16, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !291, file: !35, line: 147, baseType: !118, size: 64, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !232, file: !35, line: 151, baseType: !48, size: 16, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !232, file: !35, line: 152, baseType: !48, size: 16, offset: 848)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !232, file: !35, line: 153, baseType: !286, size: 128, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !216, file: !124, line: 72, baseType: !304, size: 64, offset: 1216)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !216, file: !124, line: 73, baseType: !215, size: 64, offset: 1280)
!306 = !{!307}
!307 = !DISubrange(count: 1024)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "internals", scope: !310, file: !311, line: 36, type: !313, isLocal: true, isDefinition: true)
!310 = distinct !DICompileUnit(language: DW_LANG_C99, file: !311, producer: "clang version 12.0.1 (https://github.com/llvm/llvm-project.git fed41342a82f5a3a9201819a82bf7a48313e296b)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !212, globals: !312, splitDebugInlining: false, nameTableKind: None)
!311 = !DIFile(filename: "internal.c", directory: "/nobackup/klee_LLVM_12/dnsproxy")
!312 = !{!308}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "internal", file: !311, line: 30, size: 128, elements: !315)
!315 = !{!316, !317, !318}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !314, file: !311, line: 31, baseType: !7, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !314, file: !311, line: 32, baseType: !7, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !314, file: !311, line: 33, baseType: !313, size: 64, offset: 64)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "log_on_syslog", scope: !321, file: !322, line: 30, type: !63, isLocal: true, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 12.0.1 (https://github.com/llvm/llvm-project.git fed41342a82f5a3a9201819a82bf7a48313e296b)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !212, globals: !323, splitDebugInlining: false, nameTableKind: None)
!322 = !DIFile(filename: "log.c", directory: "/nobackup/klee_LLVM_12/dnsproxy")
!323 = !{!319}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "tv", scope: !326, file: !327, line: 29, type: !385, isLocal: true, isDefinition: true)
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 12.0.1 (https://github.com/llvm/llvm-project.git fed41342a82f5a3a9201819a82bf7a48313e296b)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !212, globals: !328, splitDebugInlining: false, nameTableKind: None)
!327 = !DIFile(filename: "stats.c", directory: "/nobackup/klee_LLVM_12/dnsproxy")
!328 = !{!329, !324}
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "timeout", scope: !326, file: !327, line: 28, type: !331, isLocal: true, isDefinition: true)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event", file: !35, line: 123, size: 1024, elements: !332)
!332 = !{!333, !361, !371, !372, !373, !399, !400, !401}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ev_evcallback", scope: !331, file: !35, line: 124, baseType: !334, size: 320)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "event_callback", file: !35, line: 107, size: 320, elements: !335)
!335 = !{!336, !343, !344, !345, !346, !360}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_active_next", scope: !334, file: !35, line: 108, baseType: !337, size: 128)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !334, file: !35, line: 108, size: 128, elements: !338)
!338 = !{!339, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !337, file: !35, line: 108, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !337, file: !35, line: 108, baseType: !342, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_flags", scope: !334, file: !35, line: 109, baseType: !48, size: 16, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_pri", scope: !334, file: !35, line: 110, baseType: !50, size: 8, offset: 144)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_closure", scope: !334, file: !35, line: 111, baseType: !50, size: 8, offset: 152)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cb_union", scope: !334, file: !35, line: 118, baseType: !347, size: 64, offset: 192)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !334, file: !35, line: 113, size: 64, elements: !348)
!348 = !{!349, !350, !354, !359}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_callback", scope: !347, file: !35, line: 114, baseType: !60, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_selfcb", scope: !347, file: !35, line: 115, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !340, !32}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_evfinalize", scope: !347, file: !35, line: 116, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !358, !32}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_cbfinalize", scope: !347, file: !35, line: 117, baseType: !351, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "evcb_arg", scope: !334, file: !35, line: 119, baseType: !32, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout_pos", scope: !331, file: !35, line: 130, baseType: !362, size: 128, offset: 320)
!362 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !35, line: 127, size: 128, elements: !363)
!363 = !{!364, !370}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ev_next_with_common_timeout", scope: !362, file: !35, line: 128, baseType: !365, size: 128)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !362, file: !35, line: 128, size: 128, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !365, file: !35, line: 128, baseType: !358, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !365, file: !35, line: 128, baseType: !369, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "min_heap_idx", scope: !362, file: !35, line: 129, baseType: !63, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ev_fd", scope: !331, file: !35, line: 131, baseType: !63, size: 32, offset: 448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ev_base", scope: !331, file: !35, line: 133, baseType: !86, size: 64, offset: 512)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ev_", scope: !331, file: !35, line: 149, baseType: !374, size: 256, offset: 576)
!374 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !331, file: !35, line: 135, size: 256, elements: !375)
!375 = !{!376, !389}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io", scope: !374, file: !35, line: 140, baseType: !377, size: 256)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !374, file: !35, line: 137, size: 256, elements: !378)
!378 = !{!379, !384}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "ev_io_next", scope: !377, file: !35, line: 138, baseType: !380, size: 128)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !35, line: 138, size: 128, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !380, file: !35, line: 138, baseType: !358, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !380, file: !35, line: 138, baseType: !369, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !377, file: !35, line: 139, baseType: !385, size: 128, offset: 128)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !101, line: 8, size: 128, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !385, file: !101, line: 10, baseType: !104, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !385, file: !101, line: 11, baseType: !107, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal", scope: !374, file: !35, line: 148, baseType: !390, size: 256)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !374, file: !35, line: 143, size: 256, elements: !391)
!391 = !{!392, !397, !398}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ev_signal_next", scope: !390, file: !35, line: 144, baseType: !393, size: 128)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !390, file: !35, line: 144, size: 128, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "le_next", scope: !393, file: !35, line: 144, baseType: !358, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "le_prev", scope: !393, file: !35, line: 144, baseType: !369, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ev_ncalls", scope: !390, file: !35, line: 145, baseType: !48, size: 16, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ev_pncalls", scope: !390, file: !35, line: 147, baseType: !118, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ev_events", scope: !331, file: !35, line: 151, baseType: !48, size: 16, offset: 832)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ev_res", scope: !331, file: !35, line: 152, baseType: !48, size: 16, offset: 848)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ev_timeout", scope: !331, file: !35, line: 153, baseType: !385, size: 128, offset: 896)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "clang version 12.0.1 (https://github.com/llvm/llvm-project.git fed41342a82f5a3a9201819a82bf7a48313e296b)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "daemon.c", directory: "/nobackup/klee_LLVM_12/dnsproxy")
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "clang version 12.0.1 (https://github.com/llvm/llvm-project.git fed41342a82f5a3a9201819a82bf7a48313e296b)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !212, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "parse.c", directory: "/nobackup/klee_LLVM_12/dnsproxy")
!406 = !{!"clang version 12.0.1 (https://github.com/llvm/llvm-project.git fed41342a82f5a3a9201819a82bf7a48313e296b)"}
!407 = !{i32 7, !"Dwarf Version", i32 4}
!408 = !{i32 2, !"Debug Info Version", i32 3}
!409 = !{i32 1, !"wchar_size", i32 4}
!410 = distinct !DISubprogram(name: "signal_handler", scope: !3, file: !3, line: 58, type: !61, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !211)
!411 = !DILocalVariable(name: "sig", arg: 1, scope: !410, file: !3, line: 58, type: !63)
!412 = !DILocation(line: 58, column: 20, scope: !410)
!413 = !DILocalVariable(name: "event", arg: 2, scope: !410, file: !3, line: 58, type: !48)
!414 = !DILocation(line: 58, column: 31, scope: !410)
!415 = !DILocalVariable(name: "arg", arg: 3, scope: !410, file: !3, line: 58, type: !32)
!416 = !DILocation(line: 58, column: 44, scope: !410)
!417 = !DILocation(line: 60, column: 8, scope: !410)
!418 = !DILocation(line: 61, column: 32, scope: !410)
!419 = !DILocation(line: 61, column: 2, scope: !410)
!420 = !DILocation(line: 62, column: 1, scope: !410)
!421 = distinct !DISubprogram(name: "klee_dump_memory", scope: !3, file: !3, line: 236, type: !422, scopeLine: 236, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !211)
!422 = !DISubroutineType(types: !423)
!423 = !{null}
!424 = !DILocation(line: 236, column: 26, scope: !421)
!425 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 239, type: !426, scopeLine: 240, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !211)
!426 = !DISubroutineType(types: !427)
!427 = !{!63, !63, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!429 = !DILocalVariable(name: "argc", arg: 1, scope: !425, file: !3, line: 239, type: !63)
!430 = !DILocation(line: 239, column: 10, scope: !425)
!431 = !DILocalVariable(name: "argv", arg: 2, scope: !425, file: !3, line: 239, type: !428)
!432 = !DILocation(line: 239, column: 22, scope: !425)
!433 = !DILocalVariable(name: "ch", scope: !425, file: !3, line: 241, type: !63)
!434 = !DILocation(line: 241, column: 6, scope: !425)
!435 = !DILocalVariable(name: "pw", scope: !425, file: !3, line: 242, type: !436)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !438, line: 49, size: 384, elements: !439)
!438 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!439 = !{!440, !441, !442, !444, !446, !447, !448}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !437, file: !438, line: 51, baseType: !167, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !437, file: !438, line: 52, baseType: !167, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !437, file: !438, line: 54, baseType: !443, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !53, line: 146, baseType: !7)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !437, file: !438, line: 55, baseType: !445, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !53, line: 147, baseType: !7)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !437, file: !438, line: 56, baseType: !167, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !437, file: !438, line: 57, baseType: !167, size: 64, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !437, file: !438, line: 58, baseType: !167, size: 64, offset: 320)
!449 = !DILocation(line: 242, column: 17, scope: !425)
!450 = !DILocalVariable(name: "addr", scope: !425, file: !3, line: 243, type: !128)
!451 = !DILocation(line: 243, column: 21, scope: !425)
!452 = !DILocalVariable(name: "evq", scope: !425, file: !3, line: 244, type: !34)
!453 = !DILocation(line: 244, column: 15, scope: !425)
!454 = !DILocalVariable(name: "eva", scope: !425, file: !3, line: 244, type: !34)
!455 = !DILocation(line: 244, column: 20, scope: !425)
!456 = !DILocalVariable(name: "evsigint", scope: !425, file: !3, line: 245, type: !34)
!457 = !DILocation(line: 245, column: 15, scope: !425)
!458 = !DILocalVariable(name: "evsigterm", scope: !425, file: !3, line: 245, type: !34)
!459 = !DILocation(line: 245, column: 25, scope: !425)
!460 = !DILocalVariable(name: "evsighup", scope: !425, file: !3, line: 245, type: !34)
!461 = !DILocation(line: 245, column: 36, scope: !425)
!462 = !DILocalVariable(name: "config", scope: !425, file: !3, line: 246, type: !463)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!465 = !DILocation(line: 246, column: 14, scope: !425)
!466 = !DILocalVariable(name: "daemonize", scope: !425, file: !3, line: 247, type: !63)
!467 = !DILocation(line: 247, column: 6, scope: !425)
!468 = !DILocation(line: 250, column: 2, scope: !425)
!469 = !DILocation(line: 250, column: 22, scope: !425)
!470 = !DILocation(line: 250, column: 28, scope: !425)
!471 = !DILocation(line: 250, column: 15, scope: !425)
!472 = !DILocation(line: 250, column: 13, scope: !425)
!473 = !DILocation(line: 250, column: 44, scope: !425)
!474 = !DILocation(line: 251, column: 11, scope: !475)
!475 = distinct !DILexicalBlock(scope: !425, file: !3, line: 250, column: 51)
!476 = !DILocation(line: 251, column: 3, scope: !475)
!477 = !DILocation(line: 253, column: 13, scope: !478)
!478 = distinct !DILexicalBlock(scope: !475, file: !3, line: 251, column: 15)
!479 = !DILocation(line: 253, column: 11, scope: !478)
!480 = !DILocation(line: 254, column: 4, scope: !478)
!481 = !DILocation(line: 256, column: 14, scope: !478)
!482 = !DILocation(line: 257, column: 4, scope: !478)
!483 = !DILocation(line: 259, column: 12, scope: !478)
!484 = !DILocation(line: 259, column: 4, scope: !478)
!485 = !DILocation(line: 260, column: 4, scope: !478)
!486 = !DILocation(line: 264, column: 12, scope: !478)
!487 = !DILocation(line: 264, column: 4, scope: !478)
!488 = !DILocation(line: 270, column: 4, scope: !478)
!489 = distinct !{!489, !468, !490, !491}
!490 = !DILocation(line: 272, column: 2, scope: !425)
!491 = !{!"llvm.loop.mustprogress"}
!492 = !DILocation(line: 275, column: 13, scope: !493)
!493 = distinct !DILexicalBlock(scope: !425, file: !3, line: 275, column: 6)
!494 = !DILocation(line: 275, column: 7, scope: !493)
!495 = !DILocation(line: 275, column: 6, scope: !425)
!496 = !DILocation(line: 276, column: 3, scope: !493)
!497 = !DILocation(line: 278, column: 16, scope: !425)
!498 = !DILocation(line: 279, column: 2, scope: !425)
!499 = !DILocation(line: 280, column: 30, scope: !425)
!500 = !DILocation(line: 280, column: 2, scope: !425)
!501 = !DILocation(line: 281, column: 7, scope: !502)
!502 = distinct !DILexicalBlock(scope: !425, file: !3, line: 281, column: 6)
!503 = !DILocation(line: 281, column: 21, scope: !502)
!504 = !DILocation(line: 281, column: 25, scope: !502)
!505 = !DILocation(line: 281, column: 6, scope: !425)
!506 = !DILocation(line: 282, column: 3, scope: !502)
!507 = !DILocation(line: 284, column: 7, scope: !508)
!508 = distinct !DILexicalBlock(scope: !425, file: !3, line: 284, column: 6)
!509 = !DILocation(line: 284, column: 6, scope: !425)
!510 = !DILocation(line: 285, column: 14, scope: !508)
!511 = !DILocation(line: 285, column: 12, scope: !508)
!512 = !DILocation(line: 285, column: 3, scope: !508)
!513 = !DILocation(line: 288, column: 20, scope: !514)
!514 = distinct !DILexicalBlock(scope: !425, file: !3, line: 288, column: 6)
!515 = !DILocation(line: 288, column: 18, scope: !514)
!516 = !DILocation(line: 288, column: 52, scope: !514)
!517 = !DILocation(line: 288, column: 6, scope: !425)
!518 = !DILocation(line: 289, column: 49, scope: !514)
!519 = !DILocation(line: 289, column: 40, scope: !514)
!520 = !DILocation(line: 289, column: 3, scope: !514)
!521 = !DILocation(line: 291, column: 2, scope: !425)
!522 = !DILocation(line: 292, column: 35, scope: !425)
!523 = !DILocation(line: 292, column: 25, scope: !425)
!524 = !DILocation(line: 292, column: 7, scope: !425)
!525 = !DILocation(line: 292, column: 16, scope: !425)
!526 = !DILocation(line: 292, column: 23, scope: !425)
!527 = !DILocation(line: 293, column: 24, scope: !425)
!528 = !DILocation(line: 293, column: 18, scope: !425)
!529 = !DILocation(line: 293, column: 7, scope: !425)
!530 = !DILocation(line: 293, column: 16, scope: !425)
!531 = !DILocation(line: 294, column: 7, scope: !425)
!532 = !DILocation(line: 294, column: 18, scope: !425)
!533 = !DILocation(line: 296, column: 11, scope: !534)
!534 = distinct !DILexicalBlock(scope: !425, file: !3, line: 296, column: 6)
!535 = !DILocation(line: 296, column: 23, scope: !534)
!536 = !DILocation(line: 296, column: 6, scope: !534)
!537 = !DILocation(line: 296, column: 63, scope: !534)
!538 = !DILocation(line: 296, column: 6, scope: !425)
!539 = !DILocation(line: 297, column: 47, scope: !534)
!540 = !DILocation(line: 297, column: 38, scope: !534)
!541 = !DILocation(line: 297, column: 3, scope: !534)
!542 = !DILocation(line: 300, column: 21, scope: !543)
!543 = distinct !DILexicalBlock(scope: !425, file: !3, line: 300, column: 6)
!544 = !DILocation(line: 300, column: 19, scope: !543)
!545 = !DILocation(line: 300, column: 53, scope: !543)
!546 = !DILocation(line: 300, column: 6, scope: !425)
!547 = !DILocation(line: 301, column: 49, scope: !543)
!548 = !DILocation(line: 301, column: 40, scope: !543)
!549 = !DILocation(line: 301, column: 3, scope: !543)
!550 = !DILocation(line: 304, column: 2, scope: !425)
!551 = !DILocation(line: 305, column: 49, scope: !425)
!552 = !DILocation(line: 305, column: 39, scope: !425)
!553 = !DILocation(line: 305, column: 37, scope: !425)
!554 = !DILocation(line: 306, column: 38, scope: !425)
!555 = !DILocation(line: 306, column: 32, scope: !425)
!556 = !DILocation(line: 306, column: 30, scope: !425)
!557 = !DILocation(line: 307, column: 32, scope: !425)
!558 = !DILocation(line: 309, column: 2, scope: !425)
!559 = !DILocation(line: 310, column: 45, scope: !425)
!560 = !DILocation(line: 310, column: 35, scope: !425)
!561 = !DILocation(line: 310, column: 33, scope: !425)
!562 = !DILocation(line: 311, column: 34, scope: !425)
!563 = !DILocation(line: 311, column: 28, scope: !425)
!564 = !DILocation(line: 311, column: 26, scope: !425)
!565 = !DILocation(line: 312, column: 28, scope: !425)
!566 = !DILocation(line: 315, column: 6, scope: !567)
!567 = distinct !DILexicalBlock(scope: !425, file: !3, line: 315, column: 6)
!568 = !DILocation(line: 315, column: 6, scope: !425)
!569 = !DILocation(line: 316, column: 7, scope: !570)
!570 = distinct !DILexicalBlock(scope: !571, file: !3, line: 316, column: 7)
!571 = distinct !DILexicalBlock(scope: !567, file: !3, line: 315, column: 17)
!572 = !DILocation(line: 316, column: 20, scope: !570)
!573 = !DILocation(line: 316, column: 7, scope: !571)
!574 = !DILocation(line: 317, column: 4, scope: !570)
!575 = !DILocation(line: 318, column: 3, scope: !571)
!576 = !DILocation(line: 319, column: 2, scope: !571)
!577 = !DILocation(line: 322, column: 6, scope: !578)
!578 = distinct !DILexicalBlock(scope: !425, file: !3, line: 322, column: 6)
!579 = !DILocation(line: 322, column: 6, scope: !425)
!580 = !DILocation(line: 323, column: 17, scope: !581)
!581 = distinct !DILexicalBlock(scope: !578, file: !3, line: 322, column: 12)
!582 = !DILocation(line: 323, column: 8, scope: !581)
!583 = !DILocation(line: 323, column: 6, scope: !581)
!584 = !DILocation(line: 324, column: 8, scope: !585)
!585 = distinct !DILexicalBlock(scope: !581, file: !3, line: 324, column: 7)
!586 = !DILocation(line: 324, column: 7, scope: !581)
!587 = !DILocation(line: 325, column: 36, scope: !585)
!588 = !DILocation(line: 325, column: 4, scope: !585)
!589 = !DILocation(line: 326, column: 2, scope: !581)
!590 = !DILocation(line: 329, column: 6, scope: !591)
!591 = distinct !DILexicalBlock(scope: !425, file: !3, line: 329, column: 6)
!592 = !DILocation(line: 329, column: 6, scope: !425)
!593 = !DILocation(line: 330, column: 14, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !3, line: 330, column: 7)
!595 = distinct !DILexicalBlock(scope: !591, file: !3, line: 329, column: 17)
!596 = !DILocation(line: 330, column: 7, scope: !594)
!597 = !DILocation(line: 330, column: 25, scope: !594)
!598 = !DILocation(line: 330, column: 7, scope: !595)
!599 = !DILocation(line: 331, column: 36, scope: !594)
!600 = !DILocation(line: 331, column: 4, scope: !594)
!601 = !DILocation(line: 332, column: 7, scope: !602)
!602 = distinct !DILexicalBlock(scope: !595, file: !3, line: 332, column: 7)
!603 = !DILocation(line: 332, column: 18, scope: !602)
!604 = !DILocation(line: 332, column: 7, scope: !595)
!605 = !DILocation(line: 333, column: 4, scope: !602)
!606 = !DILocation(line: 334, column: 2, scope: !595)
!607 = !DILocation(line: 337, column: 6, scope: !608)
!608 = distinct !DILexicalBlock(scope: !425, file: !3, line: 337, column: 6)
!609 = !DILocation(line: 337, column: 6, scope: !425)
!610 = !DILocation(line: 338, column: 21, scope: !611)
!611 = distinct !DILexicalBlock(scope: !612, file: !3, line: 338, column: 7)
!612 = distinct !DILexicalBlock(scope: !608, file: !3, line: 337, column: 12)
!613 = !DILocation(line: 338, column: 25, scope: !611)
!614 = !DILocation(line: 338, column: 7, scope: !611)
!615 = !DILocation(line: 338, column: 33, scope: !611)
!616 = !DILocation(line: 338, column: 7, scope: !612)
!617 = !DILocation(line: 339, column: 36, scope: !611)
!618 = !DILocation(line: 339, column: 27, scope: !611)
!619 = !DILocation(line: 339, column: 4, scope: !611)
!620 = !DILocation(line: 341, column: 17, scope: !621)
!621 = distinct !DILexicalBlock(scope: !612, file: !3, line: 341, column: 7)
!622 = !DILocation(line: 341, column: 21, scope: !621)
!623 = !DILocation(line: 341, column: 29, scope: !621)
!624 = !DILocation(line: 341, column: 33, scope: !621)
!625 = !DILocation(line: 341, column: 41, scope: !621)
!626 = !DILocation(line: 341, column: 45, scope: !621)
!627 = !DILocation(line: 341, column: 7, scope: !621)
!628 = !DILocation(line: 341, column: 53, scope: !621)
!629 = !DILocation(line: 341, column: 7, scope: !612)
!630 = !DILocation(line: 342, column: 36, scope: !621)
!631 = !DILocation(line: 342, column: 27, scope: !621)
!632 = !DILocation(line: 342, column: 4, scope: !621)
!633 = !DILocation(line: 353, column: 17, scope: !634)
!634 = distinct !DILexicalBlock(scope: !612, file: !3, line: 353, column: 7)
!635 = !DILocation(line: 353, column: 21, scope: !634)
!636 = !DILocation(line: 353, column: 29, scope: !634)
!637 = !DILocation(line: 353, column: 33, scope: !634)
!638 = !DILocation(line: 353, column: 41, scope: !634)
!639 = !DILocation(line: 353, column: 45, scope: !634)
!640 = !DILocation(line: 353, column: 7, scope: !634)
!641 = !DILocation(line: 353, column: 53, scope: !634)
!642 = !DILocation(line: 353, column: 7, scope: !612)
!643 = !DILocation(line: 354, column: 36, scope: !634)
!644 = !DILocation(line: 354, column: 27, scope: !634)
!645 = !DILocation(line: 354, column: 4, scope: !634)
!646 = !DILocation(line: 364, column: 2, scope: !612)
!647 = !DILocation(line: 366, column: 2, scope: !425)
!648 = !DILocation(line: 369, column: 2, scope: !425)
!649 = !DILocation(line: 370, column: 2, scope: !425)
!650 = !DILocation(line: 371, column: 2, scope: !425)
!651 = !DILocation(line: 372, column: 2, scope: !425)
!652 = !DILocation(line: 373, column: 2, scope: !425)
!653 = !DILocation(line: 374, column: 2, scope: !425)
!654 = !DILocation(line: 377, column: 2, scope: !425)
!655 = !DILocation(line: 380, column: 18, scope: !425)
!656 = !DILocation(line: 380, column: 49, scope: !425)
!657 = !DILocation(line: 380, column: 2, scope: !425)
!658 = !DILocation(line: 381, column: 18, scope: !425)
!659 = !DILocation(line: 381, column: 51, scope: !425)
!660 = !DILocation(line: 381, column: 2, scope: !425)
!661 = !DILocation(line: 382, column: 2, scope: !425)
!662 = !DILocation(line: 383, column: 2, scope: !425)
!663 = !DILocation(line: 386, column: 2, scope: !425)
!664 = !DILocation(line: 388, column: 2, scope: !425)
!665 = distinct !DISubprogram(name: "do_query", scope: !3, file: !3, line: 84, type: !61, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !211)
!666 = !DILocalVariable(name: "fd", arg: 1, scope: !665, file: !3, line: 84, type: !63)
!667 = !DILocation(line: 84, column: 14, scope: !665)
!668 = !DILocalVariable(name: "event", arg: 2, scope: !665, file: !3, line: 84, type: !48)
!669 = !DILocation(line: 84, column: 24, scope: !665)
!670 = !DILocalVariable(name: "arg", arg: 3, scope: !665, file: !3, line: 84, type: !32)
!671 = !DILocation(line: 84, column: 37, scope: !665)
!672 = !DILocalVariable(name: "buf", scope: !665, file: !3, line: 86, type: !673)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 32768, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 4096)
!676 = !DILocation(line: 86, column: 7, scope: !665)
!677 = !DILocalVariable(name: "byte", scope: !665, file: !3, line: 87, type: !63)
!678 = !DILocation(line: 87, column: 6, scope: !665)
!679 = !DILocalVariable(name: "fromaddr", scope: !665, file: !3, line: 88, type: !128)
!680 = !DILocation(line: 88, column: 21, scope: !665)
!681 = !DILocalVariable(name: "fromlen", scope: !665, file: !3, line: 89, type: !7)
!682 = !DILocation(line: 89, column: 15, scope: !665)
!683 = !DILocalVariable(name: "req", scope: !665, file: !3, line: 90, type: !122)
!684 = !DILocation(line: 90, column: 18, scope: !665)
!685 = !DILocalVariable(name: "tv", scope: !665, file: !3, line: 91, type: !100)
!686 = !DILocation(line: 91, column: 17, scope: !665)
!687 = !DILocation(line: 93, column: 2, scope: !665)
!688 = !DILocation(line: 96, column: 28, scope: !665)
!689 = !DILocation(line: 96, column: 12, scope: !665)
!690 = !DILocation(line: 96, column: 2, scope: !665)
!691 = !DILocation(line: 99, column: 23, scope: !692)
!692 = distinct !DILexicalBlock(scope: !665, file: !3, line: 99, column: 6)
!693 = !DILocation(line: 99, column: 27, scope: !692)
!694 = !DILocation(line: 100, column: 8, scope: !692)
!695 = !DILocation(line: 99, column: 14, scope: !692)
!696 = !DILocation(line: 99, column: 12, scope: !692)
!697 = !DILocation(line: 100, column: 49, scope: !692)
!698 = !DILocation(line: 99, column: 6, scope: !665)
!699 = !DILocation(line: 101, column: 41, scope: !700)
!700 = distinct !DILexicalBlock(scope: !692, file: !3, line: 100, column: 56)
!701 = !DILocation(line: 101, column: 32, scope: !700)
!702 = !DILocation(line: 101, column: 3, scope: !700)
!703 = !DILocation(line: 102, column: 3, scope: !700)
!704 = !DILocation(line: 103, column: 3, scope: !700)
!705 = !DILocation(line: 107, column: 6, scope: !706)
!706 = distinct !DILexicalBlock(scope: !665, file: !3, line: 107, column: 6)
!707 = !DILocation(line: 107, column: 11, scope: !706)
!708 = !DILocation(line: 107, column: 6, scope: !665)
!709 = !DILocation(line: 109, column: 26, scope: !710)
!710 = distinct !DILexicalBlock(scope: !706, file: !3, line: 107, column: 17)
!711 = !DILocation(line: 109, column: 7, scope: !710)
!712 = !DILocation(line: 108, column: 3, scope: !710)
!713 = !DILocation(line: 110, column: 3, scope: !710)
!714 = !DILocation(line: 111, column: 3, scope: !710)
!715 = !DILocation(line: 115, column: 13, scope: !716)
!716 = distinct !DILexicalBlock(scope: !665, file: !3, line: 115, column: 6)
!717 = !DILocation(line: 115, column: 11, scope: !716)
!718 = !DILocation(line: 115, column: 48, scope: !716)
!719 = !DILocation(line: 115, column: 6, scope: !665)
!720 = !DILocation(line: 116, column: 32, scope: !721)
!721 = distinct !DILexicalBlock(scope: !716, file: !3, line: 115, column: 57)
!722 = !DILocation(line: 116, column: 23, scope: !721)
!723 = !DILocation(line: 116, column: 3, scope: !721)
!724 = !DILocation(line: 117, column: 3, scope: !721)
!725 = !DILocation(line: 118, column: 3, scope: !721)
!726 = !DILocation(line: 122, column: 12, scope: !665)
!727 = !DILocation(line: 122, column: 2, scope: !665)
!728 = !DILocation(line: 122, column: 7, scope: !665)
!729 = !DILocation(line: 122, column: 10, scope: !665)
!730 = !DILocation(line: 123, column: 10, scope: !665)
!731 = !DILocation(line: 123, column: 15, scope: !665)
!732 = !DILocation(line: 123, column: 2, scope: !665)
!733 = !DILocation(line: 124, column: 10, scope: !665)
!734 = !DILocation(line: 124, column: 15, scope: !665)
!735 = !DILocation(line: 124, column: 2, scope: !665)
!736 = !DILocation(line: 124, column: 26, scope: !665)
!737 = !DILocation(line: 127, column: 27, scope: !738)
!738 = distinct !DILexicalBlock(scope: !665, file: !3, line: 127, column: 6)
!739 = !DILocation(line: 127, column: 6, scope: !738)
!740 = !DILocation(line: 127, column: 6, scope: !665)
!741 = !DILocation(line: 128, column: 20, scope: !742)
!742 = distinct !DILexicalBlock(scope: !738, file: !3, line: 127, column: 38)
!743 = !DILocation(line: 128, column: 3, scope: !742)
!744 = !DILocation(line: 128, column: 8, scope: !742)
!745 = !DILocation(line: 128, column: 18, scope: !742)
!746 = !DILocation(line: 130, column: 2, scope: !742)
!747 = !DILocation(line: 132, column: 3, scope: !748)
!748 = distinct !DILexicalBlock(scope: !738, file: !3, line: 130, column: 9)
!749 = !DILocation(line: 132, column: 8, scope: !748)
!750 = !DILocation(line: 132, column: 18, scope: !748)
!751 = !DILocation(line: 137, column: 19, scope: !665)
!752 = !DILocation(line: 137, column: 2, scope: !665)
!753 = !DILocation(line: 140, column: 10, scope: !665)
!754 = !DILocation(line: 140, column: 19, scope: !665)
!755 = !DILocation(line: 140, column: 24, scope: !665)
!756 = !DILocation(line: 140, column: 2, scope: !665)
!757 = !DILocation(line: 142, column: 6, scope: !758)
!758 = distinct !DILexicalBlock(scope: !665, file: !3, line: 142, column: 6)
!759 = !DILocation(line: 142, column: 11, scope: !758)
!760 = !DILocation(line: 142, column: 6, scope: !665)
!761 = !DILocation(line: 145, column: 14, scope: !762)
!762 = distinct !DILexicalBlock(scope: !758, file: !3, line: 142, column: 22)
!763 = !DILocation(line: 145, column: 19, scope: !762)
!764 = !DILocation(line: 145, column: 44, scope: !762)
!765 = !DILocation(line: 145, column: 3, scope: !762)
!766 = !DILocation(line: 146, column: 13, scope: !762)
!767 = !DILocation(line: 146, column: 6, scope: !762)
!768 = !DILocation(line: 146, column: 12, scope: !762)
!769 = !DILocation(line: 146, column: 35, scope: !762)
!770 = !DILocation(line: 146, column: 42, scope: !762)
!771 = !DILocation(line: 147, column: 14, scope: !762)
!772 = !DILocation(line: 147, column: 19, scope: !762)
!773 = !DILocation(line: 147, column: 3, scope: !762)
!774 = !DILocation(line: 150, column: 22, scope: !775)
!775 = distinct !DILexicalBlock(scope: !762, file: !3, line: 150, column: 7)
!776 = !DILocation(line: 150, column: 35, scope: !775)
!777 = !DILocation(line: 150, column: 54, scope: !775)
!778 = !DILocation(line: 150, column: 40, scope: !775)
!779 = !DILocation(line: 151, column: 9, scope: !775)
!780 = !DILocation(line: 150, column: 15, scope: !775)
!781 = !DILocation(line: 150, column: 13, scope: !775)
!782 = !DILocation(line: 152, column: 38, scope: !775)
!783 = !DILocation(line: 150, column: 7, scope: !762)
!784 = !DILocation(line: 153, column: 40, scope: !785)
!785 = distinct !DILexicalBlock(scope: !775, file: !3, line: 152, column: 45)
!786 = !DILocation(line: 153, column: 31, scope: !785)
!787 = !DILocation(line: 153, column: 4, scope: !785)
!788 = !DILocation(line: 154, column: 4, scope: !785)
!789 = !DILocation(line: 155, column: 4, scope: !785)
!790 = !DILocation(line: 158, column: 3, scope: !762)
!791 = !DILocation(line: 160, column: 2, scope: !762)
!792 = !DILocation(line: 163, column: 14, scope: !793)
!793 = distinct !DILexicalBlock(scope: !758, file: !3, line: 160, column: 9)
!794 = !DILocation(line: 163, column: 19, scope: !793)
!795 = !DILocation(line: 163, column: 44, scope: !793)
!796 = !DILocation(line: 163, column: 3, scope: !793)
!797 = !DILocation(line: 164, column: 13, scope: !793)
!798 = !DILocation(line: 164, column: 6, scope: !793)
!799 = !DILocation(line: 164, column: 12, scope: !793)
!800 = !DILocation(line: 164, column: 39, scope: !793)
!801 = !DILocation(line: 164, column: 46, scope: !793)
!802 = !DILocation(line: 165, column: 14, scope: !793)
!803 = !DILocation(line: 165, column: 19, scope: !793)
!804 = !DILocation(line: 165, column: 3, scope: !793)
!805 = !DILocation(line: 168, column: 22, scope: !806)
!806 = distinct !DILexicalBlock(scope: !793, file: !3, line: 168, column: 7)
!807 = !DILocation(line: 168, column: 35, scope: !806)
!808 = !DILocation(line: 168, column: 54, scope: !806)
!809 = !DILocation(line: 168, column: 40, scope: !806)
!810 = !DILocation(line: 169, column: 9, scope: !806)
!811 = !DILocation(line: 168, column: 15, scope: !806)
!812 = !DILocation(line: 168, column: 13, scope: !806)
!813 = !DILocation(line: 170, column: 38, scope: !806)
!814 = !DILocation(line: 168, column: 7, scope: !793)
!815 = !DILocation(line: 171, column: 40, scope: !816)
!816 = distinct !DILexicalBlock(scope: !806, file: !3, line: 170, column: 45)
!817 = !DILocation(line: 171, column: 31, scope: !816)
!818 = !DILocation(line: 171, column: 4, scope: !816)
!819 = !DILocation(line: 172, column: 4, scope: !816)
!820 = !DILocation(line: 173, column: 4, scope: !816)
!821 = !DILocation(line: 176, column: 3, scope: !793)
!822 = !DILocation(line: 178, column: 1, scope: !665)
!823 = distinct !DISubprogram(name: "do_answer", scope: !3, file: !3, line: 187, type: !61, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !211)
!824 = !DILocalVariable(name: "fd", arg: 1, scope: !823, file: !3, line: 187, type: !63)
!825 = !DILocation(line: 187, column: 15, scope: !823)
!826 = !DILocalVariable(name: "event", arg: 2, scope: !823, file: !3, line: 187, type: !48)
!827 = !DILocation(line: 187, column: 25, scope: !823)
!828 = !DILocalVariable(name: "arg", arg: 3, scope: !823, file: !3, line: 187, type: !32)
!829 = !DILocation(line: 187, column: 38, scope: !823)
!830 = !DILocalVariable(name: "buf", scope: !823, file: !3, line: 189, type: !673)
!831 = !DILocation(line: 189, column: 7, scope: !823)
!832 = !DILocalVariable(name: "byte", scope: !823, file: !3, line: 190, type: !63)
!833 = !DILocation(line: 190, column: 6, scope: !823)
!834 = !DILocalVariable(name: "query", scope: !823, file: !3, line: 191, type: !122)
!835 = !DILocation(line: 191, column: 18, scope: !823)
!836 = !DILocation(line: 194, column: 28, scope: !823)
!837 = !DILocation(line: 194, column: 12, scope: !823)
!838 = !DILocation(line: 194, column: 2, scope: !823)
!839 = !DILocation(line: 197, column: 23, scope: !840)
!840 = distinct !DILexicalBlock(scope: !823, file: !3, line: 197, column: 6)
!841 = !DILocation(line: 197, column: 27, scope: !840)
!842 = !DILocation(line: 197, column: 48, scope: !840)
!843 = !DILocation(line: 197, column: 14, scope: !840)
!844 = !DILocation(line: 197, column: 12, scope: !840)
!845 = !DILocation(line: 197, column: 61, scope: !840)
!846 = !DILocation(line: 197, column: 6, scope: !823)
!847 = !DILocation(line: 198, column: 41, scope: !848)
!848 = distinct !DILexicalBlock(scope: !840, file: !3, line: 197, column: 68)
!849 = !DILocation(line: 198, column: 32, scope: !848)
!850 = !DILocation(line: 198, column: 3, scope: !848)
!851 = !DILocation(line: 199, column: 3, scope: !848)
!852 = !DILocation(line: 200, column: 3, scope: !848)
!853 = !DILocation(line: 204, column: 6, scope: !854)
!854 = distinct !DILexicalBlock(scope: !823, file: !3, line: 204, column: 6)
!855 = !DILocation(line: 204, column: 11, scope: !854)
!856 = !DILocation(line: 204, column: 6, scope: !823)
!857 = !DILocation(line: 205, column: 3, scope: !858)
!858 = distinct !DILexicalBlock(scope: !854, file: !3, line: 204, column: 17)
!859 = !DILocation(line: 206, column: 3, scope: !858)
!860 = !DILocation(line: 207, column: 3, scope: !858)
!861 = !DILocation(line: 211, column: 33, scope: !862)
!862 = distinct !DILexicalBlock(scope: !823, file: !3, line: 211, column: 6)
!863 = !DILocation(line: 211, column: 15, scope: !862)
!864 = !DILocation(line: 211, column: 13, scope: !862)
!865 = !DILocation(line: 211, column: 61, scope: !862)
!866 = !DILocation(line: 211, column: 6, scope: !823)
!867 = !DILocation(line: 212, column: 3, scope: !868)
!868 = distinct !DILexicalBlock(scope: !862, file: !3, line: 211, column: 70)
!869 = !DILocation(line: 213, column: 3, scope: !868)
!870 = !DILocation(line: 215, column: 13, scope: !823)
!871 = !DILocation(line: 215, column: 20, scope: !823)
!872 = !DILocation(line: 215, column: 2, scope: !823)
!873 = !DILocation(line: 216, column: 22, scope: !823)
!874 = !DILocation(line: 216, column: 2, scope: !823)
!875 = !DILocation(line: 219, column: 10, scope: !823)
!876 = !DILocation(line: 219, column: 19, scope: !823)
!877 = !DILocation(line: 219, column: 26, scope: !823)
!878 = !DILocation(line: 219, column: 2, scope: !823)
!879 = !DILocation(line: 222, column: 13, scope: !880)
!880 = distinct !DILexicalBlock(scope: !823, file: !3, line: 222, column: 6)
!881 = !DILocation(line: 222, column: 25, scope: !880)
!882 = !DILocation(line: 222, column: 44, scope: !880)
!883 = !DILocation(line: 222, column: 30, scope: !880)
!884 = !DILocation(line: 223, column: 8, scope: !880)
!885 = !DILocation(line: 223, column: 28, scope: !880)
!886 = !DILocation(line: 223, column: 35, scope: !880)
!887 = !DILocation(line: 222, column: 6, scope: !880)
!888 = !DILocation(line: 224, column: 36, scope: !880)
!889 = !DILocation(line: 222, column: 6, scope: !823)
!890 = !DILocation(line: 225, column: 39, scope: !891)
!891 = distinct !DILexicalBlock(scope: !880, file: !3, line: 224, column: 43)
!892 = !DILocation(line: 225, column: 30, scope: !891)
!893 = !DILocation(line: 225, column: 3, scope: !891)
!894 = !DILocation(line: 226, column: 3, scope: !891)
!895 = !DILocation(line: 227, column: 2, scope: !891)
!896 = !DILocation(line: 228, column: 3, scope: !880)
!897 = !DILocation(line: 230, column: 7, scope: !823)
!898 = !DILocation(line: 230, column: 2, scope: !823)
!899 = !DILocation(line: 231, column: 1, scope: !823)
!900 = distinct !DISubprogram(name: "timeout", scope: !3, file: !3, line: 70, type: !61, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !211)
!901 = !DILocalVariable(name: "fd", arg: 1, scope: !900, file: !3, line: 70, type: !63)
!902 = !DILocation(line: 70, column: 13, scope: !900)
!903 = !DILocalVariable(name: "event", arg: 2, scope: !900, file: !3, line: 70, type: !48)
!904 = !DILocation(line: 70, column: 23, scope: !900)
!905 = !DILocalVariable(name: "arg", arg: 3, scope: !900, file: !3, line: 70, type: !32)
!906 = !DILocation(line: 70, column: 36, scope: !900)
!907 = !DILocation(line: 72, column: 40, scope: !900)
!908 = !DILocation(line: 72, column: 22, scope: !900)
!909 = !DILocation(line: 72, column: 2, scope: !900)
!910 = !DILocation(line: 73, column: 25, scope: !900)
!911 = !DILocation(line: 73, column: 7, scope: !900)
!912 = !DILocation(line: 73, column: 2, scope: !900)
!913 = !DILocation(line: 74, column: 2, scope: !900)
!914 = !DILocation(line: 75, column: 1, scope: !900)
!915 = distinct !DISubprogram(name: "daemon", scope: !403, file: !403, line: 39, type: !916, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !402, retainedNodes: !211)
!916 = !DISubroutineType(types: !917)
!917 = !{!63, !63, !63}
!918 = !DILocalVariable(name: "nochdir", arg: 1, scope: !915, file: !403, line: 39, type: !63)
!919 = !DILocation(line: 39, column: 12, scope: !915)
!920 = !DILocalVariable(name: "noclose", arg: 2, scope: !915, file: !403, line: 39, type: !63)
!921 = !DILocation(line: 39, column: 25, scope: !915)
!922 = !DILocalVariable(name: "fd", scope: !915, file: !403, line: 41, type: !63)
!923 = !DILocation(line: 41, column: 6, scope: !915)
!924 = !DILocation(line: 43, column: 10, scope: !915)
!925 = !DILocation(line: 43, column: 2, scope: !915)
!926 = !DILocation(line: 45, column: 3, scope: !927)
!927 = distinct !DILexicalBlock(scope: !915, file: !403, line: 43, column: 18)
!928 = !DILocation(line: 47, column: 3, scope: !927)
!929 = !DILocation(line: 49, column: 3, scope: !927)
!930 = !DILocation(line: 52, column: 6, scope: !931)
!931 = distinct !DILexicalBlock(scope: !915, file: !403, line: 52, column: 6)
!932 = !DILocation(line: 52, column: 15, scope: !931)
!933 = !DILocation(line: 52, column: 6, scope: !915)
!934 = !DILocation(line: 53, column: 3, scope: !931)
!935 = !DILocation(line: 55, column: 7, scope: !936)
!936 = distinct !DILexicalBlock(scope: !915, file: !403, line: 55, column: 6)
!937 = !DILocation(line: 55, column: 6, scope: !915)
!938 = !DILocation(line: 56, column: 7, scope: !939)
!939 = distinct !DILexicalBlock(scope: !936, file: !403, line: 56, column: 7)
!940 = !DILocation(line: 56, column: 7, scope: !936)
!941 = !DILocation(line: 57, column: 25, scope: !939)
!942 = !DILocation(line: 56, column: 16, scope: !939)
!943 = !DILocation(line: 59, column: 7, scope: !944)
!944 = distinct !DILexicalBlock(scope: !915, file: !403, line: 59, column: 6)
!945 = !DILocation(line: 59, column: 15, scope: !944)
!946 = !DILocation(line: 59, column: 24, scope: !944)
!947 = !DILocation(line: 59, column: 22, scope: !944)
!948 = !DILocation(line: 59, column: 54, scope: !944)
!949 = !DILocation(line: 59, column: 6, scope: !915)
!950 = !DILocation(line: 60, column: 14, scope: !951)
!951 = distinct !DILexicalBlock(scope: !944, file: !403, line: 59, column: 61)
!952 = !DILocation(line: 60, column: 9, scope: !951)
!953 = !DILocation(line: 61, column: 14, scope: !951)
!954 = !DILocation(line: 61, column: 9, scope: !951)
!955 = !DILocation(line: 62, column: 14, scope: !951)
!956 = !DILocation(line: 62, column: 9, scope: !951)
!957 = !DILocation(line: 63, column: 7, scope: !958)
!958 = distinct !DILexicalBlock(scope: !951, file: !403, line: 63, column: 7)
!959 = !DILocation(line: 63, column: 10, scope: !958)
!960 = !DILocation(line: 63, column: 7, scope: !951)
!961 = !DILocation(line: 64, column: 17, scope: !958)
!962 = !DILocation(line: 64, column: 10, scope: !958)
!963 = !DILocation(line: 64, column: 4, scope: !958)
!964 = !DILocation(line: 65, column: 2, scope: !951)
!965 = !DILocation(line: 66, column: 2, scope: !915)
!966 = !DILocation(line: 67, column: 1, scope: !915)
!967 = distinct !DISubprogram(name: "hash_add_request", scope: !210, file: !210, line: 32, type: !968, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !209, retainedNodes: !211)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !215}
!970 = !DILocalVariable(name: "req", arg: 1, scope: !967, file: !210, line: 32, type: !215)
!971 = !DILocation(line: 32, column: 34, scope: !967)
!972 = !DILocalVariable(name: "p", scope: !967, file: !210, line: 34, type: !304)
!973 = !DILocation(line: 34, column: 19, scope: !967)
!974 = !DILocation(line: 34, column: 37, scope: !967)
!975 = !DILocation(line: 34, column: 24, scope: !967)
!976 = !DILocation(line: 36, column: 20, scope: !977)
!977 = distinct !DILexicalBlock(scope: !967, file: !210, line: 36, column: 6)
!978 = !DILocation(line: 36, column: 19, scope: !977)
!979 = !DILocation(line: 36, column: 7, scope: !977)
!980 = !DILocation(line: 36, column: 12, scope: !977)
!981 = !DILocation(line: 36, column: 17, scope: !977)
!982 = !DILocation(line: 36, column: 23, scope: !977)
!983 = !DILocation(line: 36, column: 6, scope: !967)
!984 = !DILocation(line: 37, column: 17, scope: !985)
!985 = distinct !DILexicalBlock(scope: !977, file: !210, line: 36, column: 32)
!986 = !DILocation(line: 37, column: 22, scope: !985)
!987 = !DILocation(line: 37, column: 5, scope: !985)
!988 = !DILocation(line: 37, column: 4, scope: !985)
!989 = !DILocation(line: 37, column: 9, scope: !985)
!990 = !DILocation(line: 37, column: 14, scope: !985)
!991 = !DILocation(line: 38, column: 3, scope: !985)
!992 = !DILocation(line: 39, column: 2, scope: !985)
!993 = !DILocation(line: 40, column: 7, scope: !967)
!994 = !DILocation(line: 40, column: 3, scope: !967)
!995 = !DILocation(line: 40, column: 5, scope: !967)
!996 = !DILocation(line: 41, column: 14, scope: !967)
!997 = !DILocation(line: 41, column: 2, scope: !967)
!998 = !DILocation(line: 41, column: 7, scope: !967)
!999 = !DILocation(line: 41, column: 12, scope: !967)
!1000 = !DILocation(line: 43, column: 2, scope: !967)
!1001 = !DILocation(line: 44, column: 1, scope: !967)
!1002 = distinct !DISubprogram(name: "hash_remove_request", scope: !210, file: !210, line: 47, type: !968, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !209, retainedNodes: !211)
!1003 = !DILocalVariable(name: "req", arg: 1, scope: !1002, file: !210, line: 47, type: !215)
!1004 = !DILocation(line: 47, column: 37, scope: !1002)
!1005 = !DILocation(line: 49, column: 7, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1002, file: !210, line: 49, column: 6)
!1007 = !DILocation(line: 49, column: 12, scope: !1006)
!1008 = !DILocation(line: 49, column: 6, scope: !1002)
!1009 = !DILocation(line: 49, column: 18, scope: !1006)
!1010 = !DILocation(line: 50, column: 6, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1002, file: !210, line: 50, column: 6)
!1012 = !DILocation(line: 50, column: 11, scope: !1011)
!1013 = !DILocation(line: 50, column: 6, scope: !1002)
!1014 = !DILocation(line: 51, column: 21, scope: !1011)
!1015 = !DILocation(line: 51, column: 26, scope: !1011)
!1016 = !DILocation(line: 51, column: 3, scope: !1011)
!1017 = !DILocation(line: 51, column: 8, scope: !1011)
!1018 = !DILocation(line: 51, column: 14, scope: !1011)
!1019 = !DILocation(line: 51, column: 19, scope: !1011)
!1020 = !DILocation(line: 52, column: 15, scope: !1002)
!1021 = !DILocation(line: 52, column: 20, scope: !1002)
!1022 = !DILocation(line: 52, column: 3, scope: !1002)
!1023 = !DILocation(line: 52, column: 8, scope: !1002)
!1024 = !DILocation(line: 52, column: 13, scope: !1002)
!1025 = !DILocation(line: 53, column: 2, scope: !1002)
!1026 = !DILocation(line: 53, column: 7, scope: !1002)
!1027 = !DILocation(line: 53, column: 12, scope: !1002)
!1028 = !DILocation(line: 55, column: 2, scope: !1002)
!1029 = !DILocation(line: 56, column: 1, scope: !1002)
!1030 = distinct !DISubprogram(name: "hash_find_request", scope: !210, file: !210, line: 59, type: !1031, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !209, retainedNodes: !211)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!215, !26}
!1033 = !DILocalVariable(name: "id", arg: 1, scope: !1030, file: !210, line: 59, type: !26)
!1034 = !DILocation(line: 59, column: 34, scope: !1030)
!1035 = !DILocalVariable(name: "req", scope: !1030, file: !210, line: 61, type: !215)
!1036 = !DILocation(line: 61, column: 18, scope: !1030)
!1037 = !DILocation(line: 61, column: 37, scope: !1030)
!1038 = !DILocation(line: 61, column: 24, scope: !1030)
!1039 = !DILocation(line: 63, column: 2, scope: !1030)
!1040 = !DILocation(line: 64, column: 8, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !210, line: 64, column: 7)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !210, line: 63, column: 11)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !210, line: 63, column: 2)
!1044 = distinct !DILexicalBlock(scope: !1030, file: !210, line: 63, column: 2)
!1045 = !DILocation(line: 64, column: 7, scope: !1042)
!1046 = !DILocation(line: 64, column: 13, scope: !1041)
!1047 = !DILocation(line: 65, column: 7, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1042, file: !210, line: 65, column: 7)
!1049 = !DILocation(line: 65, column: 12, scope: !1048)
!1050 = !DILocation(line: 65, column: 18, scope: !1048)
!1051 = !DILocation(line: 65, column: 15, scope: !1048)
!1052 = !DILocation(line: 65, column: 7, scope: !1042)
!1053 = !DILocation(line: 65, column: 22, scope: !1048)
!1054 = !DILocation(line: 66, column: 9, scope: !1042)
!1055 = !DILocation(line: 66, column: 14, scope: !1042)
!1056 = !DILocation(line: 66, column: 7, scope: !1042)
!1057 = !DILocation(line: 63, column: 2, scope: !1043)
!1058 = distinct !{!1058, !1059, !1060}
!1059 = !DILocation(line: 63, column: 2, scope: !1044)
!1060 = !DILocation(line: 67, column: 2, scope: !1044)
!1061 = !DILocation(line: 69, column: 9, scope: !1030)
!1062 = !DILocation(line: 69, column: 2, scope: !1030)
!1063 = distinct !DISubprogram(name: "add_internal", scope: !311, file: !311, line: 39, type: !1064, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !310, retainedNodes: !211)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!63, !167}
!1066 = !DILocalVariable(name: "s", arg: 1, scope: !1063, file: !311, line: 39, type: !167)
!1067 = !DILocation(line: 39, column: 20, scope: !1063)
!1068 = !DILocalVariable(name: "p", scope: !1063, file: !311, line: 41, type: !167)
!1069 = !DILocation(line: 41, column: 8, scope: !1063)
!1070 = !DILocalVariable(name: "mask", scope: !1063, file: !311, line: 42, type: !63)
!1071 = !DILocation(line: 42, column: 6, scope: !1063)
!1072 = !DILocalVariable(name: "addr", scope: !1063, file: !311, line: 43, type: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !129, line: 31, size: 32, elements: !1074)
!1074 = !{!1075}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !1073, file: !129, line: 33, baseType: !140, size: 32)
!1076 = !DILocation(line: 43, column: 17, scope: !1063)
!1077 = !DILocalVariable(name: "ipa", scope: !1063, file: !311, line: 44, type: !313)
!1078 = !DILocation(line: 44, column: 19, scope: !1063)
!1079 = !DILocation(line: 46, column: 6, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1063, file: !311, line: 46, column: 6)
!1081 = !DILocation(line: 46, column: 8, scope: !1080)
!1082 = !DILocation(line: 46, column: 6, scope: !1063)
!1083 = !DILocation(line: 47, column: 3, scope: !1080)
!1084 = !DILocation(line: 49, column: 18, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1063, file: !311, line: 49, column: 6)
!1086 = !DILocation(line: 49, column: 11, scope: !1085)
!1087 = !DILocation(line: 49, column: 9, scope: !1085)
!1088 = !DILocation(line: 49, column: 27, scope: !1085)
!1089 = !DILocation(line: 49, column: 6, scope: !1063)
!1090 = !DILocation(line: 50, column: 17, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1085, file: !311, line: 49, column: 36)
!1092 = !DILocation(line: 50, column: 18, scope: !1091)
!1093 = !DILocation(line: 50, column: 10, scope: !1091)
!1094 = !DILocation(line: 50, column: 32, scope: !1091)
!1095 = !DILocation(line: 50, column: 8, scope: !1091)
!1096 = !DILocation(line: 51, column: 4, scope: !1091)
!1097 = !DILocation(line: 51, column: 6, scope: !1091)
!1098 = !DILocation(line: 52, column: 2, scope: !1091)
!1099 = !DILocation(line: 53, column: 8, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !1085, file: !311, line: 52, column: 9)
!1101 = !DILocation(line: 56, column: 25, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1063, file: !311, line: 56, column: 6)
!1103 = !DILocation(line: 56, column: 28, scope: !1102)
!1104 = !DILocation(line: 56, column: 6, scope: !1102)
!1105 = !DILocation(line: 56, column: 35, scope: !1102)
!1106 = !DILocation(line: 56, column: 6, scope: !1063)
!1107 = !DILocation(line: 57, column: 3, scope: !1102)
!1108 = !DILocation(line: 59, column: 13, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1063, file: !311, line: 59, column: 6)
!1110 = !DILocation(line: 59, column: 11, scope: !1109)
!1111 = !DILocation(line: 59, column: 49, scope: !1109)
!1112 = !DILocation(line: 59, column: 6, scope: !1063)
!1113 = !DILocation(line: 60, column: 32, scope: !1109)
!1114 = !DILocation(line: 60, column: 23, scope: !1109)
!1115 = !DILocation(line: 60, column: 3, scope: !1109)
!1116 = !DILocation(line: 62, column: 10, scope: !1063)
!1117 = !DILocation(line: 62, column: 15, scope: !1063)
!1118 = !DILocation(line: 62, column: 2, scope: !1063)
!1119 = !DILocation(line: 63, column: 40, scope: !1063)
!1120 = !DILocation(line: 63, column: 38, scope: !1063)
!1121 = !DILocation(line: 63, column: 31, scope: !1063)
!1122 = !DILocation(line: 63, column: 14, scope: !1063)
!1123 = !DILocation(line: 63, column: 2, scope: !1063)
!1124 = !DILocation(line: 63, column: 7, scope: !1063)
!1125 = !DILocation(line: 63, column: 12, scope: !1063)
!1126 = !DILocation(line: 64, column: 15, scope: !1063)
!1127 = !DILocation(line: 64, column: 20, scope: !1063)
!1128 = !DILocation(line: 64, column: 2, scope: !1063)
!1129 = !DILocation(line: 64, column: 7, scope: !1063)
!1130 = !DILocation(line: 64, column: 12, scope: !1063)
!1131 = !DILocation(line: 65, column: 14, scope: !1063)
!1132 = !DILocation(line: 65, column: 2, scope: !1063)
!1133 = !DILocation(line: 65, column: 7, scope: !1063)
!1134 = !DILocation(line: 65, column: 12, scope: !1063)
!1135 = !DILocation(line: 66, column: 14, scope: !1063)
!1136 = !DILocation(line: 66, column: 12, scope: !1063)
!1137 = !DILocation(line: 71, column: 2, scope: !1063)
!1138 = !DILocation(line: 72, column: 1, scope: !1063)
!1139 = distinct !DISubprogram(name: "is_internal", scope: !311, file: !311, line: 75, type: !1140, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !310, retainedNodes: !211)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!63, !1073}
!1142 = !DILocalVariable(name: "arg", arg: 1, scope: !1139, file: !311, line: 75, type: !1073)
!1143 = !DILocation(line: 75, column: 28, scope: !1139)
!1144 = !DILocalVariable(name: "addr", scope: !1139, file: !311, line: 77, type: !7)
!1145 = !DILocation(line: 77, column: 15, scope: !1139)
!1146 = !DILocalVariable(name: "p", scope: !1139, file: !311, line: 78, type: !313)
!1147 = !DILocation(line: 78, column: 19, scope: !1139)
!1148 = !DILocation(line: 81, column: 2, scope: !1139)
!1149 = !DILocation(line: 83, column: 11, scope: !1150)
!1150 = distinct !DILexicalBlock(scope: !1139, file: !311, line: 83, column: 2)
!1151 = !DILocation(line: 83, column: 9, scope: !1150)
!1152 = !DILocation(line: 83, column: 7, scope: !1150)
!1153 = !DILocation(line: 83, column: 22, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1150, file: !311, line: 83, column: 2)
!1155 = !DILocation(line: 83, column: 24, scope: !1154)
!1156 = !DILocation(line: 83, column: 2, scope: !1150)
!1157 = !DILocation(line: 85, column: 7, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1159, file: !311, line: 85, column: 7)
!1159 = distinct !DILexicalBlock(scope: !1154, file: !311, line: 83, column: 46)
!1160 = !DILocation(line: 85, column: 10, scope: !1158)
!1161 = !DILocation(line: 85, column: 19, scope: !1158)
!1162 = !DILocation(line: 85, column: 26, scope: !1158)
!1163 = !DILocation(line: 85, column: 29, scope: !1158)
!1164 = !DILocation(line: 85, column: 24, scope: !1158)
!1165 = !DILocation(line: 85, column: 15, scope: !1158)
!1166 = !DILocation(line: 85, column: 7, scope: !1159)
!1167 = !DILocation(line: 86, column: 4, scope: !1158)
!1168 = !DILocation(line: 87, column: 2, scope: !1159)
!1169 = !DILocation(line: 83, column: 37, scope: !1154)
!1170 = !DILocation(line: 83, column: 40, scope: !1154)
!1171 = !DILocation(line: 83, column: 35, scope: !1154)
!1172 = !DILocation(line: 83, column: 2, scope: !1154)
!1173 = distinct !{!1173, !1156, !1174, !491}
!1174 = !DILocation(line: 87, column: 2, scope: !1150)
!1175 = !DILocation(line: 89, column: 2, scope: !1139)
!1176 = !DILocation(line: 90, column: 1, scope: !1139)
!1177 = distinct !DISubprogram(name: "log_syslog", scope: !322, file: !322, line: 33, type: !1178, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !321, retainedNodes: !211)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{null, !463}
!1180 = !DILocalVariable(name: "tag", arg: 1, scope: !1177, file: !322, line: 33, type: !463)
!1181 = !DILocation(line: 33, column: 24, scope: !1177)
!1182 = !DILocation(line: 35, column: 10, scope: !1177)
!1183 = !DILocation(line: 35, column: 2, scope: !1177)
!1184 = !DILocation(line: 36, column: 2, scope: !1177)
!1185 = !DILocation(line: 37, column: 1, scope: !1177)
!1186 = distinct !DISubprogram(name: "info", scope: !322, file: !322, line: 52, type: !1187, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !321, retainedNodes: !211)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{null, !463, null}
!1189 = !DILocalVariable(name: "fmt", arg: 1, scope: !1186, file: !322, line: 52, type: !463)
!1190 = !DILocation(line: 52, column: 18, scope: !1186)
!1191 = !DILocalVariable(name: "ap", scope: !1186, file: !322, line: 54, type: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1193, line: 52, baseType: !1194)
!1193 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1195, line: 32, baseType: !1196)
!1195 = !DIFile(filename: "LLVM_12.0_src/llvm-project/build/lib/clang/12.0.1/include/stdarg.h", directory: "/nobackup")
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !322, baseType: !1197)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1198, size: 192, elements: !1204)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !1198, file: !322, line: 54, baseType: !7, size: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !1198, file: !322, line: 54, baseType: !7, size: 32, offset: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !1198, file: !322, line: 54, baseType: !32, size: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !1198, file: !322, line: 54, baseType: !32, size: 64, offset: 128)
!1204 = !{!1205}
!1205 = !DISubrange(count: 1)
!1206 = !DILocation(line: 54, column: 10, scope: !1186)
!1207 = !DILocation(line: 56, column: 2, scope: !1186)
!1208 = !DILocation(line: 57, column: 23, scope: !1186)
!1209 = !DILocation(line: 57, column: 28, scope: !1186)
!1210 = !DILocation(line: 57, column: 2, scope: !1186)
!1211 = !DILocation(line: 58, column: 2, scope: !1186)
!1212 = !DILocation(line: 59, column: 1, scope: !1186)
!1213 = distinct !DISubprogram(name: "log_printf", scope: !322, file: !322, line: 40, type: !1214, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !321, retainedNodes: !211)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{null, !63, !463, !1216}
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1217 = !DILocalVariable(name: "level", arg: 1, scope: !1213, file: !322, line: 40, type: !63)
!1218 = !DILocation(line: 40, column: 16, scope: !1213)
!1219 = !DILocalVariable(name: "fmt", arg: 2, scope: !1213, file: !322, line: 40, type: !463)
!1220 = !DILocation(line: 40, column: 35, scope: !1213)
!1221 = !DILocalVariable(name: "ap", arg: 3, scope: !1213, file: !322, line: 40, type: !1216)
!1222 = !DILocation(line: 40, column: 48, scope: !1213)
!1223 = !DILocation(line: 42, column: 6, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1213, file: !322, line: 42, column: 6)
!1225 = !DILocation(line: 42, column: 6, scope: !1213)
!1226 = !DILocation(line: 43, column: 11, scope: !1224)
!1227 = !DILocation(line: 43, column: 18, scope: !1224)
!1228 = !DILocation(line: 43, column: 23, scope: !1224)
!1229 = !DILocation(line: 43, column: 3, scope: !1224)
!1230 = !DILocation(line: 45, column: 18, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1224, file: !322, line: 44, column: 7)
!1232 = !DILocation(line: 45, column: 26, scope: !1231)
!1233 = !DILocation(line: 45, column: 31, scope: !1231)
!1234 = !DILocation(line: 45, column: 9, scope: !1231)
!1235 = !DILocation(line: 46, column: 14, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1231, file: !322, line: 46, column: 7)
!1237 = !DILocation(line: 46, column: 7, scope: !1236)
!1238 = !DILocation(line: 46, column: 25, scope: !1236)
!1239 = !DILocation(line: 46, column: 7, scope: !1231)
!1240 = !DILocation(line: 47, column: 12, scope: !1236)
!1241 = !DILocation(line: 47, column: 4, scope: !1236)
!1242 = !DILocation(line: 49, column: 1, scope: !1213)
!1243 = distinct !DISubprogram(name: "error", scope: !322, file: !322, line: 62, type: !1187, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !321, retainedNodes: !211)
!1244 = !DILocalVariable(name: "fmt", arg: 1, scope: !1243, file: !322, line: 62, type: !463)
!1245 = !DILocation(line: 62, column: 19, scope: !1243)
!1246 = !DILocalVariable(name: "ap", scope: !1243, file: !322, line: 64, type: !1192)
!1247 = !DILocation(line: 64, column: 10, scope: !1243)
!1248 = !DILocation(line: 66, column: 2, scope: !1243)
!1249 = !DILocation(line: 67, column: 22, scope: !1243)
!1250 = !DILocation(line: 67, column: 27, scope: !1243)
!1251 = !DILocation(line: 67, column: 2, scope: !1243)
!1252 = !DILocation(line: 68, column: 2, scope: !1243)
!1253 = !DILocation(line: 69, column: 1, scope: !1243)
!1254 = distinct !DISubprogram(name: "fatal", scope: !322, file: !322, line: 72, type: !1187, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !321, retainedNodes: !211)
!1255 = !DILocalVariable(name: "fmt", arg: 1, scope: !1254, file: !322, line: 72, type: !463)
!1256 = !DILocation(line: 72, column: 19, scope: !1254)
!1257 = !DILocalVariable(name: "ap", scope: !1254, file: !322, line: 74, type: !1192)
!1258 = !DILocation(line: 74, column: 10, scope: !1254)
!1259 = !DILocation(line: 76, column: 2, scope: !1254)
!1260 = !DILocation(line: 77, column: 22, scope: !1254)
!1261 = !DILocation(line: 77, column: 27, scope: !1254)
!1262 = !DILocation(line: 77, column: 2, scope: !1254)
!1263 = !DILocation(line: 78, column: 2, scope: !1254)
!1264 = !DILocation(line: 80, column: 2, scope: !1254)
!1265 = distinct !DISubprogram(name: "parse", scope: !405, file: !405, line: 34, type: !1266, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !404, retainedNodes: !211)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!63, !463}
!1268 = !DILocalVariable(name: "fname", arg: 1, scope: !1265, file: !405, line: 34, type: !463)
!1269 = !DILocation(line: 34, column: 19, scope: !1265)
!1270 = !DILocalVariable(name: "f", scope: !1265, file: !405, line: 36, type: !1271)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1273, line: 7, baseType: !1274)
!1273 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1275, line: 49, size: 1728, elements: !1276)
!1275 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!1276 = !{!1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1292, !1294, !1295, !1296, !1298, !1299, !1301, !1303, !1306, !1308, !1311, !1314, !1315, !1316, !1319, !1320}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1274, file: !1275, line: 51, baseType: !63, size: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1274, file: !1275, line: 54, baseType: !167, size: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1274, file: !1275, line: 55, baseType: !167, size: 64, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1274, file: !1275, line: 56, baseType: !167, size: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1274, file: !1275, line: 57, baseType: !167, size: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1274, file: !1275, line: 58, baseType: !167, size: 64, offset: 320)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1274, file: !1275, line: 59, baseType: !167, size: 64, offset: 384)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1274, file: !1275, line: 60, baseType: !167, size: 64, offset: 448)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1274, file: !1275, line: 61, baseType: !167, size: 64, offset: 512)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1274, file: !1275, line: 64, baseType: !167, size: 64, offset: 576)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1274, file: !1275, line: 65, baseType: !167, size: 64, offset: 640)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1274, file: !1275, line: 66, baseType: !167, size: 64, offset: 704)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1274, file: !1275, line: 68, baseType: !1290, size: 64, offset: 768)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1275, line: 36, flags: DIFlagFwdDecl)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1274, file: !1275, line: 70, baseType: !1293, size: 64, offset: 832)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1274, file: !1275, line: 72, baseType: !63, size: 32, offset: 896)
